{"vllm":0,"code":1,"conduct":2,"our":3,"pledge":4,"we":5,"members":6,"contributors":7,"leaders":8,"make":9,"participation":10,"community":11,"harassment":12,"free":13,"experience":14,"everyone":15,"regardless":16,"age":17,"body":18,"size":19,"visible":20,"invisible":21,"disability":22,"ethnicity":23,"sex":24,"characteristics":25,"gender":26,"identity":27,"expression":28,"level":29,"education":30,"socioeconomic":31,"status":32,"nationality":33,"personal":34,"appearance":35,"race":36,"caste":37,"color":38,"religion":39,"sexual":40,"orientation":41,"act":42,"interact":43,"ways":44,"contribute":45,"open":46,"welcoming":47,"diverse":48,"inclusive":49,"healthy":50,"standards":51,"examples":52,"behavior":53,"contributes":54,"positive":55,"environment":56,"include":57,"demonstrating":58,"empathy":59,"kindness":60,"toward":61,"other":62,"people":63,"being":64,"respectful":65,"differing":66,"opinions":67,"viewpoints":68,"experiences":69,"giving":70,"gracefully":71,"accepting":72,"constructive":73,"feedback":74,"responsibility":75,"apologizing":76,"those":77,"affected":78,"mistakes":79,"learning":80,"from":81,"focusing":82,"what":83,"best":84,"just":85,"us":86,"individuals":87,"overall":88,"unacceptable":89,"use":90,"sexualized":91,"language":92,"imagery":93,"attention":94,"advances":95,"any":96,"kind":97,"trolling":98,"insulting":99,"derogatory":100,"comments":101,"political":102,"attacks":103,"public":104,"private":105,"publishing":106,"others":107,"information":108,"physical":109,"email":110,"address":111,"without":112,"explicit":113,"permission":114,"which":115,"could":116,"reasonably":117,"considered":118,"inappropriate":119,"professional":120,"setting":121,"enforcement":122,"responsibilities":123,"responsible":124,"clarifying":125,"enforcing":126,"acceptable":127,"take":128,"appropriate":129,"fair":130,"corrective":131,"action":132,"response":133,"deem":134,"threatening":135,"offensive":136,"harmful":137,"have":138,"right":139,"remove":140,"edit":141,"reject":142,"commits":143,"wiki":144,"edits":145,"issues":146,"contributions":147,"aligned":148,"condu":149,"ct":150,"communicate":151,"reasons":152,"moderation":153,"decisions":154,"when":155,"scope":156,"applies":157,"within":158,"all":159,"spaces":160,"also":161,"individual":162,"officially":163,"representing":164,"using":165,"official":166,"posting":167,"via":168,"social":169,"media":170,"account":171,"acting":172,"appointed":173,"representative":174,"online":175,"offline":176,"irl":177,"event":178,"instances":179,"abusive":180,"harassing":181,"otherwise":182,"may":183,"reported":184,"channel":185,"slack":186,"https":187,"ai":188,"complaints":189,"reviewed":190,"investigated":191,"promptly":192,"fairly":193,"obligated":194,"respect":195,"privacy":196,"security":197,"reporter":198,"incident":199,"guidelines":200,"follow":201,"impact":202,"determining":203,"consequences":204,"violation":205,"correction":206,"deemed":207,"unprofessional":208,"unwelcome":209,"consequence":210,"written":211,"warning":212,"providing":213,"clarity":214,"around":215,"nature":216,"explanation":217,"why":218,"apology":219,"requested":220,"through":221,"single":222,"series":223,"actions":224,"continued":225,"interaction":226,"involved":227,"including":228,"unsolicited":229,"specified":230,"period":231,"time":232,"includes":233,"avoiding":234,"interactions":235,"well":236,"external":237,"channels":238,"like":239,"violating":240,"terms":241,"lead":242,"temporary":243,"permanent":244,"ban":245,"serious":246,"sustained":247,"inappropriat":248,"sort":249,"communication":250,"allowed":251,"during":252,"pattern":253,"aggression":254,"disparagement":255,"classes":256,"attribution":257,"adapted":258,"contributor":259,"covenant":260,"www":261,"org":262,"version":263,"available":264,"v2":265,"code_of_conduct":266,"html":267,"were":268,"inspired":269,"mozilla":270,"ladder":271,"github":272,"com":273,"inclusion":274,"answers":275,"common":276,"questions":277,"about":278,"see":279,"faq":280,"translations":281,"cmake_minimum_required":282,"26":283,"building":284,"directly":285,"cmake":286,"sure":287,"you":288,"run":289,"install":290,"step":291,"places":292,"so":293,"files":294,"correct":295,"location":296,"example":297,"mkdir":298,"build":299,"cd":300,"ninja":301,"dvllm_python_executable":302,"python3":303,"dcmake_install_prefix":304,"target":305,"want":306,"only":307,"one":308,"manually":309,"_c":310,"component":311,"project":312,"vllm_extensions":313,"languages":314,"cxx":315,"cuda":316,"default":317,"can":318,"overridden":319,"dvllm_target_device":320,"used":321,"setup":322,"py":323,"set":324,"vllm_target_device":325,"cache":326,"string":327,"device":328,"backend":329,"message":330,"type":331,"cmake_build_type":332,"cmake_current_list_dir":333,"utils":334,"suppress":335,"potential":336,"warnings":337,"unused":338,"variables":339,"ignoreme":340,"vllm_python_path":341,"prevent":342,"installation":343,"dependencies":344,"cutlass":345,"cmake_install_local_only":346,"true":347,"all_components":348,"supported":349,"python":350,"versions":351,"searched":352,"order":353,"first":354,"match":355,"selected":356,"should":357,"kept":358,"sync":359,"python_supported_versions":360,"10":361,"11":362,"12":363,"amd":364,"gpu":365,"architectures":366,"hip_supported_archs":367,"gfx906":368,"gfx908":369,"gfx90a":370,"gfx942":371,"gfx950":372,"gfx1030":373,"gfx1100":374,"gfx1101":375,"gfx1200":376,"gfx1201":377,"expected":378,"torch":379,"rocm":380,"currently":381,"having":382,"incorrect":383,"pytorch":384,"results":385,"rather":386,"than":387,"error":388,"note":389,"derived":390,"pyproject":391,"toml":392,"various":393,"requirements":394,"txt":395,"consistent":396,"docker":397,"dockerfile":398,"torch_supported_version_cuda":399,"torch_supported_version_rocm":400,"try":401,"find":402,"package":403,"executable":404,"exactly":405,"matches":406,"vllm_python_executable":407,"find_python_from_executable":408,"else":409,"fatal_error":410,"please":411,"path":412,"desired":413,"before":414,"running":415,"configure":416,"endif":417,"update":418,"cmake_prefix_path":419,"append_cmake_prefix_path":420,"ensure":421,"nvcc":422,"command":423,"find_program":424,"nvcc_executable":425,"cuda_found":426,"found":427,"import":428,"configuration":429,"imports":430,"partially":431,"hip":432,"some":433,"customizations":434,"need":435,"do":436,"explicitly":437,"check_language":438,"enable_language":439,"etc":440,"find_package":441,"required":442,"nvidia":443,"check":444,"must":445,"happen":446,"after":447,"because":448,"cmake_cuda_compiler_version":449,"gets":450,"defined":451,"version_greater_equal":452,"cuda_supported_archs":453,"forward":454,"non":455,"extensions":456,"scripts":457,"strequal":458,"cpu":459,"cpu_extension":460,"return":461,"up":462,"warn":463,"isn":464,"hip_found":465,"vllm_gpu_lang":466,"torch_version":467,"version_equal":468,"saw":469,"instead":470,"elseif":471,"importing":472,"recognize":473,"sets":474,"does":475,"let":476,"get":477,"understand":478,"extension":479,"automatically":480,"enabled":481,"rocm_version_dev_major":482,"greater_equal":483,"able":484,"control":485,"compile":486,"per":487,"file":488,"basis":489,"cut":490,"down":491,"here":492,"extract":493,"cmake_cuda_flags":494,"applied":495,"globally":496,"clear_cuda_arches":497,"cuda_arch_flags":498,"extract_unique_cuda_archs_ascending":499,"cuda_archs":500,"filter":501,"archs":502,"since":503,"cuda_archs_loose_intersection":504,"targets":505,"override":506,"detected":507,"them":508,"current":509,"final":510,"arches":511,"stored":512,"vllm_gpu_arches":513,"override_gpu_arches":514,"_supported_archs":515,"query":516,"additional":517,"compilation":518,"flags":519,"given":520,"vllm_gpu_flags":521,"get_torch_gpu_compiler_flags":522,"parallelism":523,"nvcc_threads":524,"strequa":525,"list":526,"append":527,"threads":528,"fetchcontent":529,"compiled":530,"part":531,"process":532,"fetchcontent_base_dir":533,"play":534,"nicely":535,"sccache":536,"each":537,"dependency":538,"produces":539,"artifacts":540,"its":541,"binary_dir":542,"avoid":543,"conflicts":544,"between":545,"types":546,"cmake_binary_dir":547,"make_directory":548,"directory":549,"exists":550,"base":551,"overriding":552,"adding":553,"ggdb3":554,"most":555,"verbose":556,"devug":557,"info":558,"cmake_":559,"_flags_debug":560,"o0":561,"cmake_cxx_flags_debug":562,"certain":563,"functions":564,"marked":565,"nodiscard":566,"yet":567,"ignores":568,"result":569,"generates":570,"lot":571,"always":572,"mask":573,"real":574,"suppressing":575,"until":576,"properly":577,"addressed":578,"_flags":579,"wno":580,"cmake_cxx_flags":581,"define":582,"cumem_allocator":583,"vllm_cumem_ext_src":584,"csrc":585,"cpp":586,"set_gencode_flags_for_srcs":587,"srcs":588,"enabling":589,"cumem":590,"allocator":591,"link":592,"against":593,"driver":594,"library":595,"cumem_libs":596,"cuda_driver":597,"define_gpu_extension_target":598,"destination":599,"sources":600,"libraries":601,"use_sabi":602,"with_soabi":603,"vllm_ext_src":604,"mamba":605,"mamba_ssm":606,"selective_scan_fwd":607,"cu":608,"cache_kernels":609,"paged_attention_v1":610,"paged_attention_v2":611,"merge_attn_states":612,"vertical_slash_index":613,"pos_encoding_kernels":614,"activation_kernels":615,"layernorm_kernels":616,"layernorm_quant_kernels":617,"sampler":618,"cuda_view":619,"quantization":620,"gptq":621,"q_gemm":622,"compressed_tensors":623,"int8_quant_kernels":624,"fp8":625,"fused_kernels":626,"fused_layernorm_dynamic_per_token_quant":627,"gguf":628,"gguf_kernel":629,"cuda_utils_kernels":630,"custom_all_reduce":631,"torch_bindings":632,"cutlass_enable_headers_only":633,"bool":634,"enable":635,"header":636,"cutlass_revision":637,"fixes":638,"bogus":639,"messages":640,"v4":641,"revision":642,"source":643,"vllm_cutlass_src_dir":644,"provided":645,"env":646,"is_absolute":647,"get_filename_component":648,"absolute":649,"fetchcontent_declare":650,"source_dir":651,"git_repository":652,"git":653,"keep":654,"line":655,"above":656,"git_tag":657,"git_progress":658,"speed":659,"download":660,"retrieving":661,"history":662,"important":663,"git_shallow":664,"works":665,"branch":666,"names":667,"tags":668,"commit":669,"hash":670,"false":671,"fetchcontent_makeavailable":672,"awq":673,"gemm_kernels":674,"permute_cols":675,"cutlass_w8a8":676,"scaled_mm_entry":677,"fp4":678,"nvfp4_quant_entry":679,"nvfp4_scaled_mm_entry":680,"nvfp4_blockwise_moe_kernel":681,"sparse":682,"sparse_scaled_mm_entry":683,"cutlass_extensions":684,"mla":685,"cutlass_mla_entry":686,"per_token_group_quant":687,"marlin":688,"kernels":689,"least":690,"compatible":691,"group":692,"sizes":693,"shapes":694,"machete":695,"latest":696,"bf16":697,"atomicadd":698,"ptx":699,"marlin_archs":700,"generate":701,"preselected":702,"input":703,"pairs":704,"schedules":705,"marlin_gen_script":706,"cmake_current_source_dir":707,"gptq_marlin":708,"generate_kernels":709,"md5":710,"marlin_gen_script_hash":711,"generation":712,"script":713,"last":714,"execute_process":715,"cmake_command":716,"pythonpath":717,"python_executable":718,"result_variable":719,"marlin_generation_result":720,"output_variable":721,"output_file":722,"cmake_current_binary_dir":723,"marlin_g":724,"eneration":725,"log":726,"error_file":727,"marlin_generation":728,"equal":729,"failed":730,"ncheck":731,"details":732,"force":733,"completed":734,"successfully":735,"has":736,"changed":737,"skipping":738,"glob":739,"marlin_template_kernel_src":740,"kernel_":741,"set_source_files_properties":742,"properties":743,"compile_flags":744,"static":745,"global":746,"template":747,"stub":748,"marlin_srcs":749,"dense":750,"marlin_cuda_kernel":751,"marlin_24_cuda_kernel":752,"qqq":753,"marlin_qqq_gemm_kernel":754,"gptq_marlin_repack":755,"awq_marlin_repack":756,"allspark":757,"allspark_archs":758,"allspark_srcs":759,"gptq_allspark":760,"allspark_repack":761,"allspark_qgemm_w8a16":762,"scaled_mm_3x_archs":763,"cutlass_scaled_mm":764,"hopper":765,"c3x":766,"require":767,"later":768,"scaled_mm_archs":769,"0a":770,"scaled_mm_c3x_sm90":771,"scaled_mm_sm90_fp8":772,"scaled_mm_sm90_int8":773,"scaled_mm_azp_sm90_int8":774,"scaled_mm_blockwise_sm90_fp8":775,"denable_scaled_mm_sm90":776,"scaled_mm_c2x":777,"know":778,"doesn":779,"cmake_cuda_compiler_v":780,"ersion":781,"compiler":782,"recommend":783,"upgrading":784,"intend":785,"quantized":786,"models":787,"geforce":788,"blackwell":789,"sm120":790,"scaled_mm_c3x_sm120":791,"scaled_mm_sm120_fp8":792,"scaled_mm_blockwise_sm120_fp8":793,"denable_scaled_mm_sm120":794,"scaled_mm_c3x_120":795,"sm100":796,"1a":797,"scaled_mm_c3x_sm100":798,"scaled_mm_sm100_fp8":799,"scaled_mm_blockwise_sm100_fp8":800,"denable_scaled_mm_sm100":801,"scaled_mm_c3x_100":802,"c2x":803,"remaining":804,"already":805,"built":806,"3x":807,"scaled_mm_2x_archs":808,"subtract":809,"out":810,"remove_item":811,"denable_scaled_mm_c2x":812,"covered":813,"scaled_mm_c3x":814,"cutlass_scaled_sparse_mm":815,"cutlass_compressor":816,"work":817,"sparse_scaled_mm_c3x":818,"denable_sparse_scaled_mm_c3x":819,"nvfp4_scaled_mm_sm120":820,"fp4_archs":821,"nvfp4_quant_kernels":822,"uantization":823,"nvfp4_scaled_mm_sm120_kernels":824,"denable_nvfp4_sm120":825,"nvfp4":826,"clear":827,"nvfp4_experts_quant":828,"nvfp4_scaled_mm_kernels":829,"denable_nvfp4_sm100":830,"denable_cutlass_moe_sm100":831,"mla_archs":832,"cutlass_mla_kernels":833,"sm100_cutlass_mla_kernel":834,"denable_cutlass_mla":835,"add":836,"specific":837,"directories":838,"include_directories":839,"cutlass_dir":840,"77_blackwell_fmha":841,"moe":842,"kernel":843,"cutlass_moe_mm":844,"requires":845,"get_cutlass_":846,"pplx_":847,"moe_mm_data":848,"possible":849,"output":850,"grouped_mm_c3x_sm90":851,"denable_cutlass_moe_sm90":852,"grouped_mm_c3x":853,"grouped_mm_c3x_sm100":854,"cmake_cuda_compiler":855,"_version":856,"moe_data":857,"cutlass_moe_data_archs":858,"blockwise_scaled_group_mm_sm100":859,"blockwise_scaled_":860,"group_mm_sm100":861,"something":862,"sm90a":863,"machete_archs":864,"machete_gen_script":865,"machete_gen_script_hash":866,"machete_generation_result":867,"machete_generation_output":868,"machete_generation":869,"_file":870,"generated":871,"machete_gen_sources":872,"machete_pytorch":873,"w4a16":874,"quickreduce":875,"custom_quickreduce":876,"cutlass_include_dir":877,"cutlass_tools_util_include_dir":878,"uses":879,"cudagetdriverentrypointbyversion":880,"wrapper":881,"calling":882,"api":883,"causes":884,"problems":885,"linking":886,"earlier":887,"variable":888,"sidesteps":889,"issue":890,"target_compile_definitions":891,"cutlass_enable_direct_cuda_driver_call":892,"_moe_c":893,"vllm_moe_ext_src":894,"moe_align_sum_kernels":895,"topk_softmax_kernels":896,"moe_wna16":897,"moe_permute_src":898,"permute_unpermute_kernels":899,"moe_permute_unpermute_kernel":900,"moe_permute_unpermute_op":901,"vllm_moe_wna16_src":902,"marlin_moe_archs":903,"moe_marlin_gen_script":904,"marlin_moe_wna16":905,"moe_marlin_gen_script_hash":906,"moe_marlin_g":907,"en_script_hash":908,"moe_marlin_generation_result":909,"moe_marlin_generation_output":910,"moe_marlin_generation":911,"moe_wnaa16_marlin_src":912,"_rocm_c":913,"vllm_rocm_ext_src":914,"skinny_gemms":915,"ship":916,"projects":917,"external_projects":918,"flashmla":919,"flash":920,"attn":921,"overwrites":922,"vllm_flash_attn":923,"markdownlint":924,"disable":925,"md001":926,"md041":927,"align":928,"center":929,"picture":930,"prefers":931,"scheme":932,"dark":933,"srcset":934,"raw":935,"githubusercontent":936,"main":937,"docs":938,"assets":939,"logos":940,"logo":941,"text":942,"png":943,"img":944,"alt":945,"src":946,"light":947,"width":948,"55":949,"h3":950,"easy":951,"fast":952,"cheap":953,"llm":954,"serving":955,"href":956,"documentation":957,"blog":958,"arxiv":959,"abs":960,"2309":961,"06180":962,"paper":963,"vllm_project":964,"twitter":965,"discuss":966,"user":967,"forum":968,"developer":969,"news":970,"2025":971,"08":972,"hosted":973,"beijing":974,"meetup":975,"mp":976,"weixin":977,"qq":978,"dgkwg1wfpwgo2jcdtqqhxa":979,"large":980,"scale":981,"deployment":982,"slides":983,"drive":984,"google":985,"folders":986,"1pid6nsflu43dzri0eatcpgxsazdvbbqf":987,"recording":988,"chaspark":989,"live":990,"1166916873711665152":991,"05":992,"nyc":993,"lu":994,"ma":995,"c1rqyf1f":996,"presentation":997,"1_q_aw_iomjwuimf1s1ym":998,"zhjxz8cuel0ijvaquoybea":999,"usp":1000,"sharing":1001,"now":1002,"under":1003,"foundation":1004,"announcement":1005,"welcomes":1006,"01":1007,"excited":1008,"announce":1009,"alpha":1010,"release":1011,"v1":1012,"major":1013,"architectural":1014,"upgrade":1015,"7x":1016,"speedup":1017,"clean":1018,"optimized":1019,"execution":1020,"loop":1021,"zero":1022,"overhead":1023,"prefix":1024,"caching":1025,"enhanced":1026,"multimodal":1027,"support":1028,"more":1029,"post":1030,"27":1031,"summary":1032,"previous":1033,"04":1034,"asia":1035,"day":1036,"sginnovate":1037,"limited":1038,"availability":1039,"morning":1040,"evening":1041,"slots":1042,"inaugural":1043,"team":1044,"19cp6qu8u48ihb91a064xfaxrunyiboukrbxamdolloo":1045,"03":1046,"ollama":1047,"inference":1048,"night":1049,"16t2pdd1ywrnz4tu8q5r6n53c5lr5c73uv9vd2_ebo4u":1050,"china":1051,"n77gibl2coratqhtveazfg":1052,"1rehvfqmkgnvz6p3fd23hhso4c8j5wpgzv0bkylwnhyq":1053,"east":1054,"coast":1055,"7mu4k4xx":1056,"1nhiv8euff1nld3feyodm56ndml26leexcadgydltsrs":1057,"slide":1058,"id":1059,"g31441846c39_0_0":1060,"02":1061,"ninth":1062,"h7g3kuj9":1063,"meta":1064,"1jzc_pzvxrvnsfvcw":1065,"v4cfxb6pn7zz2cyp_flwo05aqg":1066,"1zk5qejiktmlq2eqcxqzlljax3m9s7nwn":1067,"view":1068,"posted":1069,"eighth":1070,"zep56hui":1071,"cloud":1072,"1epvkt4zu8jz_s5ohehpc798emsyh2bwyfruddvef7u4":1073,"1h24phewanyrl11xy5dxubvrc9f9kkjix":1074,"2024":1075,"joins":1076,"ecosystem":1077,"seventh":1078,"h0qvrajz":1079,"snowflake":1080,"goog":1081,"le":1082,"1e3cxqbv3jsfgp30swyvs3em_tw":1083,"ghohj9pajgk6kr54":1084,"1qf3rkdaboulwz9wk5toltt2fe9t6uic_hvnlfaaqx6a":1085,"created":1086,"coordinating":1087,"discussing":1088,"features":1089,"feel":1090,"join":1091,"ray":1092,"summit":1093,"held":1094,"special":1095,"track":1096,"opening":1097,"talk":1098,"1b_kqxphbtra_mdf":1099,"tr6i8rwdou5qotznceg2mkzxehm":1100,"learn":1101,"talks":1102,"youtube":1103,"playlist":1104,"plztswpqnepxl6aqwifuwuimlpfrvpksjr":1105,"users":1106,"09":1107,"sixth":1108,"87q3nvnh":1109,"1wrlgwytqfaotd5wcgspnhoaw3nq0e":1110,"9wqyp7ny93xrs":1111,"07":1112,"fifth":1113,"lp0gyjqr":1114,"aws":1115,"1rgud8acfchocghop3zmxzck9vx3rci9yfuab2bbcl4y":1116,"partnership":1117,"supports":1118,"llama":1119,"pipeline":1120,"23":1121,"llama31":1122,"06":1123,"fourth":1124,"agivllm":1125,"cloudflare":1126,"bentoml":1127,"1ij8o7v2bqei0bfeljltwc5g1s10_rhv3beed5ob0nj4":1128,"third":1129,"robloxandvllmmeetup2024":1130,"splashthat":1131,"roblox":1132,"47jak4bj39t954hytkvtfwn0fkqtsl8ngfuslrem":1133,"second":1134,"ygxbpzhl":1135,"ibm":1136,"12mi2skabnuw5rbwxdyy":1137,"hthth4imsnceoq10jdqbxga":1138,"2023":1139,"a16z":1140,"1ql":1141,"xpfxifpdbh86dbeegfxbxfxjix4v032ghshbkf3s":1142,"would":1143,"express":1144,"sincere":1145,"gratitude":1146,"andreessen":1147,"horowitz":1148,"30":1149,"supporting":1150,"generous":1151,"grant":1152,"development":1153,"research":1154,"released":1155,"fastchat":1156,"integration":1157,"powered":1158,"lmsys":1159,"vicuna":1160,"chatbot":1161,"arena":1162,"chat":1163,"mid":1164,"april":1165,"originally":1166,"developed":1167,"sky":1168,"computing":1169,"lab":1170,"cs":1171,"berkeley":1172,"edu":1173,"uc":1174,"evolved":1175,"driven":1176,"both":1177,"academia":1178,"industry":1179,"state":1180,"art":1181,"throughput":1182,"efficient":1183,"management":1184,"key":1185,"value":1186,"memory":1187,"pagedattention":1188,"20":1189,"continuous":1190,"batching":1191,"incoming":1192,"requests":1193,"model":1194,"graph":1195,"quantizations":1196,"2210":1197,"17323":1198,"2306":1199,"00978":1200,"autoround":1201,"05516":1202,"int4":1203,"int8":1204,"flashattention":1205,"flashinfer":1206,"speculative":1207,"decoding":1208,"chunked":1209,"prefill":1210,"flexible":1211,"seamless":1212,"popular":1213,"hugging":1214,"face":1215,"high":1216,"algorithms":1217,"parallel":1218,"sampling":1219,"beam":1220,"search":1221,"tensor":1222,"data":1223,"expert":1224,"distributed":1225,"streaming":1226,"outputs":1227,"openai":1228,"ap":1229,"server":1230,"gpus":1231,"cpus":1232,"intel":1233,"powerpc":1234,"tpu":1235,"neuron":1236,"multi":1237,"lora":1238,"seamlessly":1239,"huggingface":1240,"transformer":1241,"llms":1242,"mixture":1243,"mixtral":1244,"deepseek":1245,"v3":1246,"embedding":1247,"e5":1248,"mistral":1249,"modal":1250,"llava":1251,"full":1252,"en":1253,"supported_models":1254,"getting":1255,"started":1256,"pip":1257,"getting_started":1258,"index":1259,"wheel":1260,"bash":1261,"visit":1262,"quickstart":1263,"contributing":1264,"welcome":1265,"collaborations":1266,"how":1267,"sponsors":1268,"compute":1269,"resources":1270,"testing":1271,"following":1272,"organizations":1273,"thank":1274,"your":1275,"alphabetical":1276,"md":1277,"cash":1278,"donations":1279,"dropbox":1280,"sequoia":1281,"capital":1282,"skywork":1283,"zhenfund":1284,"alibaba":1285,"anyscale":1286,"crusoe":1287,"databricks":1288,"deepinfra":1289,"lambda":1290,"nebius":1291,"novita":1292,"replicate":1293,"runpod":1294,"trainy":1295,"san":1296,"diego":1297,"sponsor":1298,"fundraising":1299,"venue":1300,"opencollective":1301,"plan":1302,"fund":1303,"maintenance":1304,"adoption":1305,"citation":1306,"cite":1307,"bibtex":1308,"inproceedings":1309,"kwon2023efficient":1310,"title":1311,"author":1312,"woosuk":1313,"kwon":1314,"zhuohan":1315,"li":1316,"siyuan":1317,"zhuang":1318,"ying":1319,"sheng":1320,"lianmin":1321,"zheng":1322,"cody":1323,"hao":1324,"yu":1325,"joseph":1326,"gonzalez":1327,"zhang":1328,"ion":1329,"stoica":1330,"booktitle":1331,"proceedings":1332,"acm":1333,"sigops":1334,"29th":1335,"symposium":1336,"operating":1337,"systems":1338,"principles":1339,"year":1340,"contact":1341,"start":1342,"technical":1343,"feature":1344,"fellow":1345,"disclosures":1346,"advisories":1347,"partnerships":1348,"lists":1349,"mailto":1350,"end":1351,"kit":1352,"wish":1353,"refer":1354,"repo":1355,"releasing":1356,"releases":1357,"offer":1358,"reliable":1359,"packaged":1360,"binary":1361,"format":1362,"conveniently":1363,"accessed":1364,"pypi":1365,"serve":1366,"milestones":1367,"newly":1368,"improvements":1369,"upcoming":1370,"changes":1371,"affect":1372,"breaking":1373,"versioning":1374,"shifted":1375,"where":1376,"new":1377,"patch":1378,"every":1379,"weeks":1380,"contain":1381,"bug":1382,"opposed":1383,"semver":1384,"contains":1385,"backwards":1386,"critical":1387,"made":1388,"post1":1389,"_major_":1390,"milestone":1391,"incompatible":1392,"similar":1393,"_minor_":1394,"_patch_":1395,"_post1_":1396,"_patch":1397,"1_":1398,"either":1399,"implicit":1400,"cadence":1401,"bi":1402,"weekly":1403,"days":1404,"same":1405,"future":1406,"dates":1407,"below":1408,"tentative":1409,"optional":1410,"date":1411,"jan":1412,"feb":1413,"mar":1414,"apr":1415,"jun":1416,"jul":1417,"13":1418,"aug":1419,"14":1420,"15":1421,"sep":1422,"16":1423,"17":1424,"oct":1425,"18":1426,"19":1427,"nov":1428,"21":1429,"dec":1430,"22":1431,"dedicated":1432,"performed":1433,"prev":1434,"iously":1435,"reused":1436,"builds":1437,"triggered":1438,"push":1439,"rc":1440,"tag":1441,"vx":1442,"rc1":1443,"enables":1444,"test":1445,"multiple":1446,"rcs":1447,"trigger":1448,"notes":1449,"monitor":1450,"reverts":1451,"apply":1452,"cherry":1453,"pick":1454,"criteria":1455,"approach":1456,"finalizing":1457,"picks":1458,"land":1459,"pr":1460,"typically":1461,"sufficient":1462,"complete":1463,"thorough":1464,"round":1465,"stable":1466,"regression":1467,"functional":1468,"performance":1469,"recent":1470,"severe":1471,"silent":1472,"incorrectness":1473,"compatibility":1474,"crashes":1475,"deadlocks":1476,"leaks":1477,"introduced":1478,"change":1479,"identifiers":1480,"ci":1481,"prs":1482,"merged":1483,"trunk":1484,"exception":1485,"manual":1486,"validations":1487,"e2e":1488,"validation":1489,"perform":1490,"regressions":1491,"benchmark":1492,"workflow":1493,"workflows":1494,"yml":1495,"coverage":1496,"llama3":1497,"llama4":1498,"hardware":1499,"h100":1500,"mi300x":1501,"_note":1502,"based":1503,"availability_":1504,"access":1505,"request":1506,"write":1507,"ac":1508,"cess":1509,"repository":1510,"review":1511,"familiarize":1512,"yourself":1513,"configurations":1514,"tree":1515,"benchmarks":1516,"navigate":1517,"v0":1518,"once":1519,"completes":1520,"dashboard":1521,"hud":1522,"reponame":1523,"2fvllm":1524,"corresponding":1525,"comparison":1526,"compare":1527,"verify":1528,"occurred":1529,"vs":1530,"starttime":1531,"thu":1532,"2c":1533,"2017":1534,"20apr":1535,"202025":1536,"2021":1537,"3a43":1538,"3a50":1539,"20gmt":1540,"stoptime":1541,"wed":1542,"2016":1543,"20jul":1544,"granularity":1545,"week":1546,"lbranch":1547,"lcommit":1548,"b6553be1bc75f046b00046a4ad7576364d03c835":1549,"rbranch":1550,"rcommit":1551,"a5dd03c1ebc5e4f56f3c9d3dc0436e9c582c978f":1552,"benchmarkname":1553,"modelname":1554,"20models":1555,"backendname":1556,"20backends":1557,"modename":1558,"20modes":1559,"dtypename":1560,"20dtype":1561,"devicename":1562,"20devices":1563,"archname":1564,"20platforms":1565,"def":1566,"load_module_from_path":1567,"module_name":1568,"spec":1569,"importlib":1570,"util":1571,"spec_from_file_location":1572,"module":1573,"module_from_spec":1574,"sys":1575,"modules":1576,"loader":1577,"exec_module":1578,"is_sccache_available":1579,"none":1580,"int":1581,"os":1582,"getenv":1583,"vllm_disable_sccache":1584,"is_ccache_available":1585,"ccache":1586,"is_ninja_available":1587,"is_url_available":1588,"url":1589,"str":1590,"urllib":1591,"urlopen":1592,"except":1593,"200":1594,"class":1595,"cmakeextension":1596,"__init__":1597,"self":1598,"name":1599,"cmake_lists_dir":1600,"kwa":1601,"super":1602,"py_limited_api":1603,"abspath":1604,"cmake_build_ext":1605,"build_ext":1606,"dict":1607,"been":1608,"configured":1609,"did_config":1610,"determine":1611,"number":1612,"jobs":1613,"optionally":1614,"compute_num_jobs":1615,"num_jobs":1616,"max_jobs":1617,"envs":1618,"logger":1619,"sched_getaffinity":1620,"universally":1621,"fall":1622,"back":1623,"cpu_count":1624,"len":1625,"attributeerror":1626,"_is_cuda":1627,"get_nvcc_cuda_version":1628,"reduce":1629,"overloading":1630,"system":1631,"max":1632,"ext":1633,"ve":1634,"cmakelists":1635,"exit":1636,"early":1637,"select":1638,"optimization":1639,"debug":1640,"default_cfg":1641,"relwithdebinfo":1642,"cfg":1643,"cmake_args":1644,"dcmake_build_type":1645,"dcmake_verbose_makefile":1646,"dcmake_c_compiler_launcher":1647,"dcmake_cxx_compiler_launcher":1648,"dcmake_cuda_compiler_launcher":1649,"dcmake_hip_compiler_launcher":1650,"elif":1651,"pass":1652,"exact":1653,"reuse":1654,"subsequent":1655,"calls":1656,"dvllm_python_path":1657,"downloads":1658,"root":1659,"deps":1660,"allows":1661,"profiles":1662,"plays":1663,"fc_base_dir":1664,"root_dir":1665,"environ":1666,"dfetchcontent_base_dir":1667,"tool":1668,"num_job":1669,"dnvcc_threads":1670,"build_tool":1671,"dcmake_job_pool_compile":1672,"dcmake_job_pools":1673,"whatever":1674,"cuda_home":1675,"dcmake_cuda_compiler":1676,"bin":1677,"subprocess":1678,"check_call":1679,"cwd":1680,"build_temp":1681,"build_extensions":1682,"present":1683,"working":1684,"check_output":1685,"oserror":1686,"raise":1687,"runtimeerror":1688,"cannot":1689,"create":1690,"exist":1691,"makedirs":1692,"target_name":1693,"removeprefix":1694,"build_args":1695,"proper":1696,"outdir":1697,"get_ext_fullpath":1698,"parent":1699,"skip":1700,"directo":1701,"ry":1702,"continue":1703,"appends":1704,"range":1705,"count":1706,"actually":1707,"components":1708,"install_args":1709,"standard":1710,"copy":1711,"build_lib":1712,"included":1713,"editable":1714,"recursive":1715,"dst_file":1716,"split":1717,"print":1718,"copying":1719,"dirname":1720,"exist_ok":1721,"copy_file":1722,"precompiled_build_ext":1723,"disables":1724,"precompiled":1725,"binaries":1726,"assert":1727,"vllm_use_precompiled":1728,"precompiled_wheel_utils":1729,"extracts":1730,"existing":1731,"staticmethod":1732,"extract_precompiled_and_patch_package":1733,"wheel_url_or_path":1734,"tempfile":1735,"zipfile":1736,"temp_dir":1737,"isfile":1738,"wheel_filename":1739,"mkdtemp":1740,"wheels":1741,"wheel_path":1742,"downloading":1743,"urlretrieve":1744,"filename":1745,"package_data_patch":1746,"files_to_copy":1747,"abi3":1748,"_flashmla_c":1749,"_vllm_fa2_c":1750,"_vllm_fa3_c":1751,"compiled_regex":1752,"re":1753,"file_members":1754,"filelist":1755,"target_path":1756,"target_pa":1757,"th":1758,"wb":1759,"dst":1760,"shutil":1761,"copyfileobj":1762,"pkg":1763,"replace":1764,"setdefault":1765,"basename":1766,"finally":1767,"removing":1768,"rmtree":1769,"get_base_commit_in_main_branch":1770,"nightly":1771,"mainly":1772,"vllm_test_use_precompiled_nightly_wheel":1773,"upstream":1774,"resp_json":1775,"curl":1776,"repos":1777,"decode":1778,"utf":1779,"upstream_main_commit":1780,"json":1781,"loads":1782,"sha":1783,"context":1784,"immutable":1785,"missing":1786,"vllm_docker_build_context":1787,"local":1788,"cat":1789,"calledprocesserror":1790,"fetch":1791,"remote":1792,"branches":1793,"ensures":1794,"ref":1795,"current_branch":1796,"show":1797,"strip":1798,"base_commit":1799,"merge":1800,"valueerror":1801,"err":1802,"dev":1803,"_no_device":1804,"empty":1805,"has_cuda":1806,"_is_neuron":1807,"_is_tpu":1808,"_is_hip":1809,"_is_cpu":1810,"_is_xpu":1811,"xpu":1812,"_build_custom_ops":1813,"get_rocm_version":1814,"rocm_home":1815,"librocm":1816,"core":1817,"blob":1818,"d11f5c20d500f729c393680a01fa902ebf92094b":1819,"rocm_version":1820,"l21":1821,"librocm_core_file":1822,"lib":1823,"is_file":1824,"librocm_core":1825,"ctypes":1826,"cdll":1827,"vererrors":1828,"c_uint32":1829,"get_rocm_core_version":1830,"getrocmversion":1831,"restype":1832,"argtypes":1833,"pointer":1834,"minor":1835,"byref":1836,"get_neuronxcc_version":1837,"sysconfig":1838,"site_dir":1839,"get_paths":1840,"purelib":1841,"version_file":1842,"neuronxcc":1843,"executed":1844,"fp":1845,"content":1846,"read":1847,"regular":1848,"__version__":1849,"apex":1850,"8b7a1ff183741dd8f9b87e7bafd04cfde99cea28":1851,"nvcc_output":1852,"universal_newlines":1853,"release_idx":1854,"nvcc_cuda_version":1855,"parse":1856,"get_gaudi_sw_version":1857,"returns":1858,"console":1859,"printing":1860,"hl":1861,"smi":1862,"shell":1863,"capture_output":1864,"enable_console":1865,"returncode":1866,"stdout":1867,"get_vllm_version":1868,"get_version":1869,"write_to":1870,"might":1871,"cuda_version":1872,"main_cuda_version":1873,"cuda_version_str":1874,"tarball":1875,"sdist":1876,"argv":1877,"neuron_version":1878,"neuron_version_str":1879,"unknown":1880,"runtime":1881,"get_requirements":1882,"requirements_dir":1883,"_read_requirements":1884,"resolved_requirements":1885,"startswith":1886,"cuda_major":1887,"cuda_minor":1888,"modified_requirements":1889,"req":1890,"unsupported":1891,"platform":1892,"policy":1893,"reporting":1894,"report":1895,"privately":1896,"vulnerability":1897,"submission":1898,"form":1899,"triage":1900,"reports":1901,"triaged":1902,"vulnerability_management":1903,"threat":1904,"guide":1905,"usage":1906,"assumptions":1907,"recommendations":1908,"securely":1909,"severity":1910,"risk":1911,"taking":1912,"dealing":1913,"past":1914,"defaults":1915,"cases":1916,"categories":1917,"vulnerabilities":1918,"allow":1919,"attackers":1920,"execute":1921,"arbitrary":1922,"significantly":1923,"compromise":1924,"confidentiality":1925,"integrity":1926,"privileges":1927,"needed":1928,"network":1929,"deserialization":1930,"exploit":1931,"chains":1932,"generally":1933,"rated":1934,"cvss":1935,"flaws":1936,"elevated":1937,"rce":1938,"contexts":1939,"significant":1940,"loss":1941,"advanced":1942,"conditions":1943,"trust":1944,"modes":1945,"node":1946,"privileged":1947,"scores":1948,"moderate":1949,"cause":1950,"denial":1951,"service":1952,"partial":1953,"disruption":1954,"breach":1955,"rating":1956,"low":1957,"iss":1958,"ues":1959,"informational":1960,"logging":1961,"errors":1962,"exploitable":1963,"weaknesses":1964,"privilege":1965,"negligible":1966,"side":1967,"collisions":1968,"often":1969,"less":1970,"prenotification":1971,"prenotify":1972,"vendors":1973,"purpose":1974,"coordinated":1975,"notification":1976,"contacts":1977,"advisory":1978,"few":1979,"added":1980,"send":1981,"vendor":1982,"analyzed":1983,"case":1984,"withdraw":1985,"receiving":1986,"prenotifications":1987,"membership":1988,"refinements":1989,"who":1990,"find_cuda_init":1991,"fn":1992,"callable":1993,"object":1994,"helper":1995,"function":1996,"initialization":1997,"initializes":1998,"prints":1999,"stack":2000,"trace":2001,"happens":2002,"_lazy_init":2003,"nonlocal":2004,"traceback":2005,"extract_stack":2006,"initialized":2007,"format_list":2008,"is_allowed_file":2009,"current_file":2010,"allowed_files":2011,"is_forbidden_import":2012,"stripped":2013,"forbidden_import_re":2014,"allowed_lines":2015,"parse_diff":2016,"diff":2017,"violations":2018,"current_lineno":2019,"skip_allowed_file":2020,"splitlines":2021,"next":2022,"code_line":2023,"get_diff":2024,"diff_type":2025,"staged":2026,"cached":2027,"unified":2028,"unstaged":2029,"all_violations":2030,"diff_output":2031,"extend":2032,"stderr":2033,"forbidden":2034,"direct":2035,"triton":2036,"triton_utils":2037,"get_staged_python_files":2038,"am":2039,"endswith":2040,"forbidden_patterns":2041,"allowed_patterns":2042,"check_file":2043,"filepath":2044,"tuple":2045,"encoding":2046,"line_num":2047,"enumerate":2048,"unicodedecodeerror":2049,"total_violations":2050,"regex":2051,"noqa":2052,"e501":2053,"get_python_executable":2054,"get_cpu_cores":2055,"cores":2056,"multiprocessing":2057,"generate_presets":2058,"output_path":2059,"cmakeuserpresets":2060,"attempting":2061,"detect":2062,"nvcc_path":2063,"prospective_path":2064,"cpp_extension":2065,"nvcc_path_input":2066,"provide":2067,"usr":2068,"python_executable_prompt":2069,"virtual":2070,"home":2071,"venvs":2072,"cpu_cores":2073,"min":2074,"cmake_jobs":2075,"assuming":2076,"tools":2077,"project_root":2078,"__file__":2079,"resolvable":2080,"isabs":2081,"cache_variables":2082,"cmake_install_prefix":2083,"sourcedir":2084,"launcher":2085,"_compiler_launcher":2086,"configure_preset":2087,"binarydir":2088,"cachevariables":2089,"generator":2090,"cmake_job_pools":2091,"slower":2092,"presets":2093,"cmakeminimumrequired":2094,"configurepresets":2095,"buildpresets":2096,"configurepreset":2097,"output_file_path":2098,"overwrite":2099,"lower":2100,"cancelled":2101,"dump":2102,"indent":2103,"nto":2104,"preset":2105,"initialize":2106,"writing":2107,"is_python_file":2108,"scan_file":2109,"pickle_re":2110,"load_gitignore":2111,"repo_root":2112,"gitignore_path":2113,"gitignore":2114,"patterns":2115,"ignore":2116,"pathspec":2117,"from_lines":2118,"gitwildmatch":2119,"bad_files":2120,"dirpath":2121,"filenames":2122,"walk":2123,"abs_path":2124,"rel_path":2125,"relpath":2126,"ignored":2127,"match_file":2128,"nerror":2129,"pickle":2130,"cloudpickle":2131,"nif":2132,"intentional":2133,"check_pickle_imports":2134,"test_regex":2135,"test_cases":2136,"pkl":2137,"cpkl":2138,"dumps":2139,"timport":2140,"somethingelse":2141,"pickleas":2142,"asdf":2143,"should_match":2144,"got":2145,"tests":2146,"passed":2147,"_is_internal":2148,"_fail":2149,"iterable":2150,"disallowed":2151,"eager":2152,"lineno":2153,"msg":2154,"init_path":2155,"read_text":2156,"ast":2157,"visitor":2158,"nodevisitor":2159,"_in_type_checking":2160,"visit_if":2161,"guard_is_type_checking":2162,"isinstance":2163,"attribute":2164,"typing":2165,"attr":2166,"type_checking":2167,"child":2168,"orelse":2169,"generic_visit":2170,"visit_import":2171,"alias":2172,"allowed_imports":2173,"inside":2174,"visit_importfrom":2175,"importfrom":2176,"module_as_written":2177,"allowed_from_modules":2178,"get_attr_docs":2179,"cls_node":2180,"classdef":2181,"docstrings":2182,"placed":2183,"assignments":2184,"davidism":2185,"mit":2186,"license":2187,"pairwise":2188,"implement":2189,"itertools":2190,"removed":2191,"dropped":2192,"iterator":2193,"iter":2194,"yield":2195,"consider":2196,"pair":2197,"nodes":2198,"assignment":2199,"constant":2200,"assign":2201,"annassign":2202,"expr":2203,"doc":2204,"inspect":2205,"cleandoc":2206,"annotated":2207,"assigning":2208,"plain":2209,"configvalidator":2210,"visit_classdef":2211,"validate":2212,"config":2213,"dataclass":2214,"decorators":2215,"decorator_list":2216,"call":2217,"func":2218,"validate_class":2219,"fail":2220,"decorator":2221,"class_node":2222,"attr_docs":2223,"stmt":2224,"field":2225,"annotation":2226,"classvar":2227,"dataclasses":2228,"subscript":2229,"field_name":2230,"docstring":2231,"union":2232,"slice":2233,"args":2234,"elts":2235,"literal_args":2236,"arg":2237,"literal":2238,"literal1":2239,"literal2":2240,"validate_ast":2241,"validate_file":2242,"file_path":2243,"validating":2244,"systemexit":2245,"represents":2246,"ninja_log":2247,"creates":2248,"passing":2249,"times":2250,"seconds":2251,"float":2252,"appended":2253,"owner":2254,"weighted_duration":2255,"duration":2256,"task":2257,"setweightedduration":2258,"weightedduration":2259,"weighted":2260,"takes":2261,"elapsed":2262,"divides":2263,"many":2264,"tasks":2265,"thus":2266,"approximate":2267,"total":2268,"serialized":2269,"serializing":2270,"steps":2271,"ending":2272,"much":2273,"longer":2274,"durations":2275,"shorter":2276,"modest":2277,"floating":2278,"point":2279,"epsilon":2280,"000002":2281,"describetargets":2282,"printable":2283,"summarizes":2284,"dozens":2285,"handle":2286,"sanely":2287,"max_length":2288,"chosen":2289,"fit":2290,"long":2291,"while":2292,"minimizing":2293,"word":2294,"wrapping":2295,"65":2296,"readtargets":2297,"show_all":2298,"reads":2299,"log_file":2300,"sorted":2301,"objects":2302,"readline":2303,"v5":2304,"unrecognized":2305,"targets_dict":2306,"last_end_seen":2307,"parts":2308,"exe":2309,"rudely":2310,"halted":2311,"corrupt":2312,"silently":2313,"cmdhash":2314,"restart":2315,"convert":2316,"integral":2317,"milliseconds":2318,"1000":2319,"stamp":2320,"means":2321,"possibly":2322,"incremental":2323,"throw":2324,"away":2325,"displayed":2326,"independently":2327,"done":2328,"comparing":2329,"records":2330,"commands":2331,"guaranteed":2332,"several":2333,"row":2334,"two":2335,"go":2336,"however":2337,"repeated":2338,"stop":2339,"points":2340,"identified":2341,"reset":2342,"dictionary":2343,"values":2344,"getextension":2345,"extra_patterns":2346,"canonical":2347,"ultimately":2348,"goal":2349,"fn_pattern":2350,"fnmatch":2351,"good":2352,"grouping":2353,"type_mappings":2354,"break":2355,"capture":2356,"javac":2357,"jar":2358,"distinguished":2359,"interface":2360,"ext1":2361,"splitext":2362,"ext2":2363,"preserve":2364,"pdb":2365,"dll":2366,"pefile":2367,"grouped":2368,"together":2369,"don":2370,"listed":2371,"toc":2372,"attempt":2373,"identify":2374,"identifying":2375,"obj":2376,"categorized":2377,"mojo":2378,"jars":2379,"java":2380,"normalize":2381,"related":2382,"mojom":2383,"summarizeentries":2384,"entries":2385,"extra_step_types":2386,"beginning":2387,"due":2388,"starting":2389,"stopping":2390,"iterate":2391,"keeping":2392,"calculate":2393,"ends":2394,"own":2395,"easily":2396,"calculated":2397,"task_start_stop_times":2398,"earliest":2399,"total_cpu_time":2400,"length":2401,"weighted_total":2402,"starts":2403,"stops":2404,"come":2405,"alphabet":2406,"making":2407,"correctly":2408,"running_tasks":2409,"record":2410,"processed":2411,"deltas":2412,"last_time":2413,"accumulated":2414,"efficiently":2415,"last_weighted_time":2416,"scan":2417,"events":2418,"action_name":2419,"accumulate":2420,"num_running":2421,"running_":2422,"moment":2423,"ran":2424,"del":2425,"sum":2426,"off":2427,"half":2428,"500":2429,"untrustworthy":2430,"3f":2431,"entries_by_ext":2432,"defaultdict":2433,"items":2434,"longest":2435,"long_count":2436,"1f":2437,"average":2438,"2f":2439,"parser":2440,"argparse":2441,"argumentparser":2442,"add_argument":2443,"dest":2444,"build_directory":2445,"help":2446,"semicolon":2447,"separated":2448,"analyze":2449,"_extra_args":2450,"parse_known_args":2451,"step_types":2452,"room":2453,"extra":2454,"long_ext_count":2455,"errno":2456,"enoent":2457,"spdxstatus":2458,"enum":2459,"spdx":2460,"enumeration":2461,"missing_license":2462,"copyright":2463,"missing_copyright":2464,"missing_both":2465,"completely":2466,"check_spdx_header_status":2467,"lines":2468,"readlines":2469,"shebang":2470,"start_idx":2471,"has_license":2472,"has_copyright":2473,"headers":2474,"license_line":2475,"copyright_line":2476,"add_header":2477,"supplement":2478,"seek":2479,"truncate":2480,"full_spdx_header":2481,"writelines":2482,"insert":2483,"files_missing_both":2484,"files_missing_copyright":2485,"files_missing_license":2486,"collect":2487,"fixing":2488,"all_files_to_fix":2489,"sample_outputs":2490,"completionsequencegroupoutput":2491,"samples":2492,"sequenceoutput":2493,"parent_seq_id":2494,"output_token":2495,"logprobs":2496,"prompt_logprobs":2497,"sampler_output":2498,"sampleroutput":2499,"test_sampler_output_initialization":2500,"sampled_token_probs":2501,"sampled_token_ids":2502,"test_sampler_output_getitem":2503,"test_sampler_output_setitem":2504,"new_output":2505,"99":2506,"test_sampler_output_len":2507,"test_sampler_output_eq":2508,"sampler_output1":2509,"sampler_output2":2510,"sampler_output3":2511,"test_sequence_data_prefill":2512,"seq_data":2513,"sequencedata":2514,"from_seqs":2515,"get_num_uncomputed_tokens":2516,"get_num_computed_tokens":2517,"advance":2518,"update_num_computed_tokens":2519,"tokens":2520,"simulating":2521,"recompute":2522,"append_token_id":2523,"logprob":2524,"reset_state_for_recompute":2525,"test_sequence_group_stage":2526,"seq_group":2527,"create_dummy_prompt":2528,"is_prefill":2529,"seqs":2530,"get_seqs":2531,"seq":2532,"fixture":2533,"is_available":2534,"test_basic_functionality":2535,"num_tokens":2536,"hidden_size":2537,"num_experts":2538,"top_k":2539,"basic":2540,"functionality":2541,"routing":2542,"simulator":2543,"strategy":2544,"strategies":2545,"routingsimulator":2546,"get_available_strategies":2547,"hidden_states":2548,"randn":2549,"router_logits":2550,"simulate":2551,"topk_weights":2552,"topk_ids":2553,"simulate_routing":2554,"strategy_name":2555,"shape":2556,"wrong":2557,"weights":2558,"ids":2559,"valid":2560,"invalid":2561,"negative":2562,"too":2563,"test_routing_strategy_integration":2564,"monkeypatch":2565,"fusedmoe":2566,"pytest":2567,"importorskip":2568,"model_executor":2569,"layers":2570,"fused_moe":2571,"layer":2572,"parameters":2573,"32":2574,"different":2575,"env_name":2576,"vllm_moe_routing_simulation_strategy":2577,"setenv":2578,"reload":2579,"environment_variables":2580,"select_experts":2581,"method":2582,"use_grouped_topk":2583,"renormalize":2584,"indices_type":2585,"test_distribution_based_routing_with_custom_strategy":2586,"registering":2587,"distributionbasedrouting":2588,"custom":2589,"register":2590,"distribution":2591,"custom_strategy":2592,"normal":2593,"mean":2594,"std":2595,"register_strategy":2596,"custom_normal":2597,"60":2598,"48":2599,"test_instance_compatibility":2600,"methods":2601,"uniform_random":2602,"test_version_is_defined":2603,"test_version_tuple":2604,"__version_tuple__":2605,"test_prev_minor_version_was":2606,"version_tuple":2607,"version_str":2608,"_prev_minor_version_was":2609,"_read_prompts":2610,"prompts":2611,"imageassetprompts":2612,"typeddict":2613,"stop_sign":2614,"cherry_blossom":2615,"imagetestassets":2616,"imageasset":2617,"convenience":2618,"prompt":2619,"image":2620,"returned":2621,"iterating":2622,"videoassetprompts":2623,"baby_reading":2624,"videotestassets":2625,"videoasset":2626,"audioassetprompts":2627,"mary_had_lamb":2628,"winning_call":2629,"audiotestassets":2630,"audioasset":2631,"cleanup_vllm_use_v1":2632,"oracle":2633,"vllm_use_v1":2634,"loading":2635,"invocation":2636,"touch":2637,"cleaned":2638,"delete":2639,"upon":2640,"modifies":2641,"delenv":2642,"run_with_both_engines":2643,"runs":2644,"twice":2645,"use_v1":2646,"param":2647,"decorated":2648,"skip_v1":2649,"skip_v0":2650,"get_closest_marker":2651,"init_test_http_connection":2652,"pytest_asyncio":2653,"async":2654,"client":2655,"anew":2656,"global_http_connection":2657,"reuse_client":2658,"dist_init":2659,"temp_file":2660,"mkstemp":2661,"init_distributed_environment":2662,"world_size":2663,"rank":2664,"distributed_init_method":2665,"local_rank":2666,"nccl":2667,"initialize_model_parallel":2668,"cleanup_dist_env_and_memory":2669,"should_do_global_cleanup_after_test":2670,"subdirectories":2671,"cleanup":2672,"10x":2673,"unit":2674,"skip_global_cleanup":2675,"cleanup_fixture":2676,"dynamo_reset":2677,"_dynamo":2678,"example_prompts":2679,"_test_prompts":2680,"example_system_message":2681,"_sys_msg":2682,"decoderprompttype":2683,"encoder":2684,"decoder":2685,"empty_str":2686,"example_encoder_decoder_prompts":2687,"explicitencoderdecoderprompt":2688,"wherein":2689,"corresponds":2690,"reverse":2691,"encoder_prompts":2692,"custom_decoder_prompts":2693,"empty_str_decoder_prompts":2694,"none_decoder_prompts":2695,"zip_enc_dec_prompts":2696,"example_long_prompts":2697,"_long_prompts":2698,"image_assets":2699,"video_assets":2700,"audio_assets":2701,"hfrunner":2702,"get_default_device":2703,"platforms":2704,"current_platform":2705,"is_cpu":2706,"device_type":2707,"wrap_device":2708,"_t":2709,"hasattr":2710,"model_name":2711,"dtype":2712,"auto":2713,"model_kwargs":2714,"trust_remote_code":2715,"is_sentence_transformer":2716,"is_cross_encoder":2717,"skip_tokenizer_init":2718,"auto_cls":2719,"_baseautomodelclass":2720,"automodelforcausallm":2721,"maybe_model_redirect":2722,"autoconfig":2723,"from_pretrained":2724,"torch_dtype":2725,"_get_and_verify_dtype":2726,"is_pooling_model":2727,"lazy":2728,"init":2729,"sentence_transformers":2730,"sentencetransformer":2731,"_remote_code":2732,"crossencoder":2733,"automodel_args":2734,"unquantized":2735,"getattr":2736,"quantization_method":2737,"bitsandbytes":2738,"tokenizer":2739,"autotokenizer":2740,"put":2741,"top":2742,"device_count":2743,"transformers":2744,"autoprocessor":2745,"f401":2746,"processor":2747,"get_inputs":2748,"images":2749,"promptimageinput":2750,"videos":2751,"promptvideoinput":2752,"audios":2753,"promptaudioinput":2754,"batchfeature":2755,"batchencoding":2756,"all_inputs":2757,"processor_kwargs":2758,"return_tensors":2759,"pt":2760,"video":2761,"audio_inputs":2762,"hack":2763,"processors":2764,"sampling_rate":2765,"audio":2766,"sr":2767,"inputs":2768,"get_prompt_embeddings":2769,"embeddings":2770,"input_ids":2771,"get_input_embeddings":2772,"squeeze":2773,"classify":2774,"logits":2775,"softmax":2776,"dim":2777,"tolist":2778,"kwargs":2779,"output_ids":2780,"use_cache":2781,"output_str":2782,"batch_decode":2783,"skip_special_tokens":2784,"clean_up_tokenization_spaces":2785,"generate_greedy":2786,"max_tokens":2787,"do_sample":2788,"max_new_tokens":2789,"generate_beam_search":2790,"beam_width":2791,"num_beams":2792,"num_return_sequences":2793,"pad_token_id":2794,"generate_greedy_logprobs":2795,"all_logprobs":2796,"output_hidden_states":2797,"return_dict_in_generate":2798,"seq_logprobs":2799,"_hidden_states_to_seq_logprobs":2800,"output_embeddings":2801,"get_output_embeddings":2802,"hidden_state":2803,"last_hidden_states":2804,"matmul":2805,"weight":2806,"bias":2807,"unsqueeze":2808,"log_softmax":2809,"float32":2810,"_hidden_states_to_logprobs":2811,"num_logprobs":2812,"output_len":2813,"seq_logprobs_lst":2814,"tok_idx":2815,"tok_logprobs":2816,"drop":2817,"reshape":2818,"topk":2819,"tok_logprobs_dct":2820,"token_id":2821,"zip":2822,"indices":2823,"item":2824,"_lst":2825,"generate_greedy_logprobs_limit":2826,"tokenstextlogprobs":2827,"all_output_ids":2828,"all_output_strs":2829,"seq_ids":2830,"sequences":2831,"output_logprobs":2832,"generate_encoder_decoder_greedy_logprobs_limit":2833,"encoder_decoder_prompts":2834,"expliciten":2835,"coderdecoderprompt":2836,"greedy":2837,"encoder_prompt":2838,"decoder_prompt":2839,"to_enc_dec_tuple_list":2840,"encoder_inputs":2841,"decoder_input_ids":2842,"decoder_inputs":2843,"decoder_hidden_states":2844,"encode":2845,"predict":2846,"convert_to_tensor":2847,"__enter__":2848,"__exit__":2849,"exc_type":2850,"exc_value":2851,"hf_runner":2852,"vllmrunner":2853,"arguments":2854,"modified":2855,"follows":2856,"seed":2857,"reproducibility":2858,"max_model_len":2859,"1024":2860,"block_size":2861,"64":2862,"devices":2863,"enable_chunked_prefill":2864,"enforce_eager":2865,"runner":2866,"runneroption":2867,"convertoption":2868,"tokenizer_name":2869,"tokenizer_mode":2870,"disable_log_stats":2871,"tensor_parallel_size":2872,"swap_space":2873,"textprompt":2874,"multi_modal_data":2875,"text_prompt_kwargs":2876,"prompt_token_ids":2877,"prompt_embeds":2878,"sampling_params":2879,"samplingparams":2880,"req_outputs":2881,"req_output":2882,"prompt_str":2883,"prompt_ids":2884,"req_sample_output_ids":2885,"req_sample_output_strs":2886,"sample":2887,"token_ids":2888,"_final_steps_generate_w_logprobs":2889,"requestoutput":2890,"tokenstextlogprobspromptlogprobs":2891,"generate_w_logprobs":2892,"toks_str_logsprobs_prompt_logprobs":2893,"omit":2894,"params":2895,"generate_encoder_decoder_w_logprobs":2896,"greedy_params":2897,"temperature":2898,"num_prompt_logprobs":2899,"stop_token_ids":2900,"greedy_logprobs_params":2901,"generate_encoder_decoder_greedy_logprobs":2902,"num_prompt_logp":2903,"robs":2904,"beam_search":2905,"beamsearchparams":2906,"returned_outputs":2907,"texts":2908,"probs":2909,"embed":2910,"reward":2911,"score":2912,"text_1":2913,"text_2":2914,"apply_model":2915,"nn":2916,"_r":2917,"llm_engine":2918,"vllm_enable_v1_multiprocessing":2919,"executor":2920,"vllm_allow_insecure_serialization":2921,"_apply_model":2922,"get_model":2923,"collective_rpc":2924,"vllm_runner":2925,"temporary_enable_log_propagate":2926,"getlogger":2927,"propagate":2928,"caplog_vllm":2929,"caplog":2930,"temporarily":2931,"depends":2932,"logs":2933,"propagated":2934,"num_gpus_available":2935,"initializing":2936,"dummy_opt_path":2937,"json_path":2938,"_dummy_opt_path":2939,