{"cmake_minimum_required":0,"version":1,"26":2,"when":3,"building":4,"directly":5,"using":6,"cmake":7,"make":8,"sure":9,"you":10,"run":11,"install":12,"step":13,"places":14,"so":15,"files":16,"correct":17,"location":18,"example":19,"mkdir":20,"build":21,"cd":22,"ninja":23,"dvllm_python_executable":24,"which":25,"python3":26,"dcmake_install_prefix":27,"target":28,"want":29,"only":30,"one":31,"manually":32,"_c":33,"component":34,"project":35,"vllm_extensions":36,"languages":37,"cxx":38,"cuda":39,"default":40,"can":41,"overridden":42,"dvllm_target_device":43,"used":44,"setup":45,"py":46,"set":47,"vllm_target_device":48,"cache":49,"string":50,"device":51,"backend":52,"vllm":53,"message":54,"status":55,"type":56,"cmake_build_type":57,"include":58,"cmake_current_list_dir":59,"utils":60,"suppress":61,"potential":62,"warnings":63,"about":64,"unused":65,"specified":66,"variables":67,"ignoreme":68,"vllm_python_path":69,"prevent":70,"installation":71,"dependencies":72,"cutlass":73,"code":74,"cmake_install_local_only":75,"true":76,"all_components":77,"supported":78,"python":79,"versions":80,"searched":81,"order":82,"first":83,"match":84,"selected":85,"should":86,"kept":87,"sync":88,"python_supported_versions":89,"10":90,"11":91,"12":92,"amd":93,"gpu":94,"architectures":95,"hip_supported_archs":96,"gfx906":97,"gfx908":98,"gfx90a":99,"gfx942":100,"gfx950":101,"gfx1030":102,"gfx1100":103,"gfx1101":104,"gfx1200":105,"gfx1201":106,"expected":107,"torch":108,"rocm":109,"currently":110,"having":111,"incorrect":112,"pytorch":113,"results":114,"warning":115,"rather":116,"than":117,"error":118,"note":119,"derived":120,"from":121,"pyproject":122,"toml":123,"various":124,"requirements":125,"txt":126,"consistent":127,"docker":128,"dockerfile":129,"torch_supported_version_cuda":130,"torch_supported_version_rocm":131,"try":132,"find":133,"package":134,"executable":135,"exactly":136,"matches":137,"vllm_python_executable":138,"find_python_from_executable":139,"else":140,"fatal_error":141,"please":142,"path":143,"desired":144,"before":145,"running":146,"configure":147,"endif":148,"update":149,"cmake_prefix_path":150,"append_cmake_prefix_path":151,"ensure":152,"nvcc":153,"command":154,"find_program":155,"nvcc_executable":156,"cuda_found":157,"found":158,"import":159,"configuration":160,"also":161,"imports":162,"partially":163,"hip":164,"some":165,"customizations":166,"need":167,"do":168,"explicitly":169,"check_language":170,"enable_language":171,"etc":172,"find_package":173,"required":174,"nvidia":175,"check":176,"must":177,"happen":178,"after":179,"because":180,"cmake_cuda_compiler_version":181,"gets":182,"defined":183,"version_greater_equal":184,"cuda_supported_archs":185,"forward":186,"non":187,"extensions":188,"external":189,"scripts":190,"strequal":191,"cpu":192,"cpu_extension":193,"return":194,"up":195,"language":196,"warn":197,"isn":198,"what":199,"hip_found":200,"vllm_gpu_lang":201,"torch_version":202,"version_equal":203,"saw":204,"instead":205,"elseif":206,"importing":207,"recognize":208,"sets":209,"does":210,"let":211,"get":212,"understand":213,"extension":214,"automatically":215,"enabled":216,"rocm_version_dev_major":217,"greater_equal":218,"we":219,"able":220,"control":221,"compile":222,"per":223,"file":224,"basis":225,"cut":226,"down":227,"time":228,"here":229,"extract":230,"remove":231,"cmake_cuda_flags":232,"applied":233,"globally":234,"clear_cuda_arches":235,"cuda_arch_flags":236,"extract_unique_cuda_archs_ascending":237,"cuda_archs":238,"filter":239,"archs":240,"since":241,"all":242,"cuda_archs_loose_intersection":243,"other":244,"targets":245,"override":246,"detected":247,"them":248,"current":249,"final":250,"arches":251,"stored":252,"vllm_gpu_arches":253,"override_gpu_arches":254,"_supported_archs":255,"query":256,"additional":257,"compilation":258,"flags":259,"given":260,"vllm_gpu_flags":261,"get_torch_gpu_compiler_flags":262,"parallelism":263,"nvcc_threads":264,"strequa":265,"list":266,"append":267,"threads":268,"use":269,"fetchcontent":270,"compiled":271,"part":272,"process":273,"fetchcontent_base_dir":274,"play":275,"nicely":276,"sccache":277,"each":278,"dependency":279,"produces":280,"artifacts":281,"its":282,"binary_dir":283,"avoid":284,"conflicts":285,"between":286,"types":287,"cmake_binary_dir":288,"make_directory":289,"directory":290,"exists":291,"base":292,"overriding":293,"adding":294,"ggdb3":295,"most":296,"verbose":297,"devug":298,"info":299,"cmake_":300,"_flags_debug":301,"o0":302,"cmake_cxx_flags_debug":303,"certain":304,"functions":305,"marked":306,"nodiscard":307,"yet":308,"ignores":309,"result":310,"generates":311,"lot":312,"always":313,"mask":314,"real":315,"issues":316,"suppressing":317,"until":318,"properly":319,"addressed":320,"_flags":321,"wno":322,"cmake_cxx_flags":323,"define":324,"cumem_allocator":325,"vllm_cumem_ext_src":326,"csrc":327,"cpp":328,"set_gencode_flags_for_srcs":329,"srcs":330,"enabling":331,"cumem":332,"allocator":333,"link":334,"against":335,"driver":336,"library":337,"cumem_libs":338,"cuda_driver":339,"define_gpu_extension_target":340,"destination":341,"sources":342,"libraries":343,"use_sabi":344,"with_soabi":345,"vllm_ext_src":346,"mamba":347,"mamba_ssm":348,"selective_scan_fwd":349,"cu":350,"cache_kernels":351,"attention":352,"paged_attention_v1":353,"paged_attention_v2":354,"merge_attn_states":355,"vertical_slash_index":356,"pos_encoding_kernels":357,"activation_kernels":358,"layernorm_kernels":359,"layernorm_quant_kernels":360,"sampler":361,"cuda_view":362,"quantization":363,"gptq":364,"q_gemm":365,"compressed_tensors":366,"int8_quant_kernels":367,"fp8":368,"common":369,"fused_kernels":370,"fused_layernorm_dynamic_per_token_quant":371,"gguf":372,"gguf_kernel":373,"cuda_utils_kernels":374,"custom_all_reduce":375,"torch_bindings":376,"cutlass_enable_headers_only":377,"bool":378,"enable":379,"header":380,"cutlass_revision":381,"fixes":382,"bogus":383,"messages":384,"v4":385,"revision":386,"source":387,"vllm_cutlass_src_dir":388,"provided":389,"env":390,"is_absolute":391,"get_filename_component":392,"absolute":393,"fetchcontent_declare":394,"source_dir":395,"git_repository":396,"https":397,"github":398,"com":399,"git":400,"keep":401,"line":402,"above":403,"git_tag":404,"git_progress":405,"speed":406,"download":407,"retrieving":408,"history":409,"important":410,"git_shallow":411,"works":412,"branch":413,"names":414,"tags":415,"commit":416,"hash":417,"false":418,"fetchcontent_makeavailable":419,"awq":420,"gemm_kernels":421,"permute_cols":422,"cutlass_w8a8":423,"scaled_mm_entry":424,"fp4":425,"nvfp4_quant_entry":426,"nvfp4_scaled_mm_entry":427,"nvfp4_blockwise_moe_kernel":428,"sparse":429,"sparse_scaled_mm_entry":430,"cutlass_extensions":431,"mla":432,"cutlass_mla_entry":433,"per_token_group_quant":434,"marlin":435,"kernels":436,"least":437,"compatible":438,"group":439,"sizes":440,"shapes":441,"machete":442,"latest":443,"bf16":444,"atomicadd":445,"ptx":446,"marlin_archs":447,"generate":448,"preselected":449,"input":450,"pairs":451,"schedules":452,"marlin_gen_script":453,"cmake_current_source_dir":454,"gptq_marlin":455,"generate_kernels":456,"md5":457,"marlin_gen_script_hash":458,"generation":459,"script":460,"last":461,"execute_process":462,"cmake_command":463,"pythonpath":464,"python_executable":465,"result_variable":466,"marlin_generation_result":467,"output_variable":468,"output_file":469,"cmake_current_binary_dir":470,"marlin_g":471,"eneration":472,"log":473,"error_file":474,"marlin_generation":475,"equal":476,"failed":477,"ncheck":478,"details":479,"force":480,"completed":481,"successfully":482,"has":483,"changed":484,"skipping":485,"glob":486,"marlin_template_kernel_src":487,"kernel_":488,"set_source_files_properties":489,"properties":490,"compile_flags":491,"static":492,"global":493,"template":494,"stub":495,"marlin_srcs":496,"dense":497,"marlin_cuda_kernel":498,"marlin_24_cuda_kernel":499,"qqq":500,"marlin_qqq_gemm_kernel":501,"gptq_marlin_repack":502,"awq_marlin_repack":503,"allspark":504,"allspark_archs":505,"allspark_srcs":506,"gptq_allspark":507,"allspark_repack":508,"allspark_qgemm_w8a16":509,"scaled_mm_3x_archs":510,"cutlass_scaled_mm":511,"hopper":512,"c3x":513,"require":514,"later":515,"scaled_mm_archs":516,"0a":517,"scaled_mm_c3x_sm90":518,"scaled_mm_sm90_fp8":519,"scaled_mm_sm90_int8":520,"scaled_mm_azp_sm90_int8":521,"scaled_mm_blockwise_sm90_fp8":522,"denable_scaled_mm_sm90":523,"scaled_mm_c2x":524,"know":525,"doesn":526,"cmake_cuda_compiler_v":527,"ersion":528,"compiler":529,"recommend":530,"upgrading":531,"intend":532,"quantized":533,"models":534,"geforce":535,"blackwell":536,"sm120":537,"scaled_mm_c3x_sm120":538,"scaled_mm_sm120_fp8":539,"scaled_mm_blockwise_sm120_fp8":540,"denable_scaled_mm_sm120":541,"scaled_mm_c3x_120":542,"sm100":543,"1a":544,"scaled_mm_c3x_sm100":545,"scaled_mm_sm100_fp8":546,"scaled_mm_blockwise_sm100_fp8":547,"denable_scaled_mm_sm100":548,"scaled_mm_c3x_100":549,"c2x":550,"remaining":551,"already":552,"built":553,"3x":554,"scaled_mm_2x_archs":555,"subtract":556,"out":557,"remove_item":558,"denable_scaled_mm_c2x":559,"covered":560,"scaled_mm_c3x":561,"cutlass_scaled_sparse_mm":562,"cutlass_compressor":563,"work":564,"sparse_scaled_mm_c3x":565,"denable_sparse_scaled_mm_c3x":566,"nvfp4_scaled_mm_sm120":567,"fp4_archs":568,"nvfp4_quant_kernels":569,"uantization":570,"nvfp4_scaled_mm_sm120_kernels":571,"denable_nvfp4_sm120":572,"nvfp4":573,"were":574,"clear":575,"nvfp4_experts_quant":576,"nvfp4_scaled_mm_kernels":577,"denable_nvfp4_sm100":578,"denable_cutlass_moe_sm100":579,"mla_archs":580,"cutlass_mla_kernels":581,"sm100_cutlass_mla_kernel":582,"denable_cutlass_mla":583,"add":584,"specific":585,"directories":586,"include_directories":587,"cutlass_dir":588,"examples":589,"77_blackwell_fmha":590,"moe":591,"kernel":592,"cutlass_moe_mm":593,"requires":594,"get_cutlass_":595,"pplx_":596,"moe_mm_data":597,"possible":598,"output":599,"grouped_mm_c3x_sm90":600,"denable_cutlass_moe_sm90":601,"grouped_mm_c3x":602,"grouped_mm_c3x_sm100":603,"cmake_cuda_compiler":604,"_version":605,"moe_data":606,"cutlass_moe_data_archs":607,"blockwise_scaled_group_mm_sm100":608,"blockwise_scaled_":609,"group_mm_sm100":610,"something":611,"sm90a":612,"machete_archs":613,"machete_gen_script":614,"machete_gen_script_hash":615,"machete_generation_result":616,"machete_generation_output":617,"machete_generation":618,"_file":619,"generated":620,"machete_gen_sources":621,"machete_pytorch":622,"w4a16":623,"quickreduce":624,"custom_quickreduce":625,"cutlass_include_dir":626,"cutlass_tools_util_include_dir":627,"uses":628,"cudagetdriverentrypointbyversion":629,"wrapper":630,"calling":631,"api":632,"causes":633,"problems":634,"linking":635,"earlier":636,"setting":637,"variable":638,"sidesteps":639,"issue":640,"target_compile_definitions":641,"private":642,"cutlass_enable_direct_cuda_driver_call":643,"_moe_c":644,"vllm_moe_ext_src":645,"moe_align_sum_kernels":646,"topk_softmax_kernels":647,"moe_wna16":648,"moe_permute_src":649,"permute_unpermute_kernels":650,"moe_permute_unpermute_kernel":651,"moe_permute_unpermute_op":652,"vllm_moe_wna16_src":653,"marlin_moe_archs":654,"moe_marlin_gen_script":655,"marlin_moe_wna16":656,"moe_marlin_gen_script_hash":657,"moe_marlin_g":658,"en_script_hash":659,"moe_marlin_generation_result":660,"moe_marlin_generation_output":661,"moe_marlin_generation":662,"moe_wnaa16_marlin_src":663,"_rocm_c":664,"vllm_rocm_ext_src":665,"skinny_gemms":666,"ship":667,"projects":668,"external_projects":669,"flashmla":670,"flash":671,"attn":672,"overwrites":673,"vllm_flash_attn":674,"conduct":675,"our":676,"pledge":677,"members":678,"contributors":679,"leaders":680,"participation":681,"community":682,"harassment":683,"free":684,"experience":685,"everyone":686,"regardless":687,"age":688,"body":689,"size":690,"visible":691,"invisible":692,"disability":693,"ethnicity":694,"sex":695,"characteristics":696,"gender":697,"identity":698,"expression":699,"level":700,"education":701,"socioeconomic":702,"nationality":703,"personal":704,"appearance":705,"race":706,"caste":707,"color":708,"religion":709,"sexual":710,"orientation":711,"act":712,"interact":713,"ways":714,"contribute":715,"open":716,"welcoming":717,"diverse":718,"inclusive":719,"healthy":720,"standards":721,"behavior":722,"contributes":723,"positive":724,"environment":725,"demonstrating":726,"empathy":727,"kindness":728,"toward":729,"people":730,"being":731,"respectful":732,"differing":733,"opinions":734,"viewpoints":735,"experiences":736,"giving":737,"gracefully":738,"accepting":739,"constructive":740,"feedback":741,"responsibility":742,"apologizing":743,"those":744,"affected":745,"mistakes":746,"learning":747,"focusing":748,"best":749,"just":750,"us":751,"individuals":752,"overall":753,"unacceptable":754,"sexualized":755,"imagery":756,"advances":757,"any":758,"kind":759,"trolling":760,"insulting":761,"derogatory":762,"comments":763,"political":764,"attacks":765,"public":766,"publishing":767,"others":768,"information":769,"physical":770,"email":771,"address":772,"without":773,"explicit":774,"permission":775,"could":776,"reasonably":777,"considered":778,"inappropriate":779,"professional":780,"enforcement":781,"responsibilities":782,"responsible":783,"clarifying":784,"enforcing":785,"acceptable":786,"take":787,"appropriate":788,"fair":789,"corrective":790,"action":791,"response":792,"deem":793,"threatening":794,"offensive":795,"harmful":796,"have":797,"right":798,"edit":799,"reject":800,"commits":801,"wiki":802,"edits":803,"contributions":804,"aligned":805,"condu":806,"ct":807,"communicate":808,"reasons":809,"moderation":810,"decisions":811,"scope":812,"applies":813,"within":814,"spaces":815,"individual":816,"officially":817,"representing":818,"official":819,"posting":820,"via":821,"social":822,"media":823,"account":824,"acting":825,"appointed":826,"representative":827,"online":828,"offline":829,"irl":830,"event":831,"instances":832,"abusive":833,"harassing":834,"otherwise":835,"may":836,"reported":837,"channel":838,"slack":839,"ai":840,"complaints":841,"reviewed":842,"investigated":843,"promptly":844,"fairly":845,"obligated":846,"respect":847,"privacy":848,"security":849,"reporter":850,"incident":851,"guidelines":852,"follow":853,"impact":854,"determining":855,"consequences":856,"violation":857,"correction":858,"deemed":859,"unprofessional":860,"unwelcome":861,"consequence":862,"written":863,"providing":864,"clarity":865,"around":866,"nature":867,"explanation":868,"why":869,"apology":870,"requested":871,"through":872,"single":873,"series":874,"actions":875,"continued":876,"interaction":877,"involved":878,"including":879,"unsolicited":880,"period":881,"includes":882,"avoiding":883,"interactions":884,"well":885,"channels":886,"like":887,"violating":888,"terms":889,"lead":890,"temporary":891,"permanent":892,"ban":893,"serious":894,"sustained":895,"inappropriat":896,"sort":897,"communication":898,"allowed":899,"during":900,"pattern":901,"aggression":902,"disparagement":903,"classes":904,"attribution":905,"adapted":906,"contributor":907,"covenant":908,"www":909,"org":910,"available":911,"v2":912,"code_of_conduct":913,"html":914,"inspired":915,"mozilla":916,"ladder":917,"inclusion":918,"answers":919,"questions":920,"see":921,"faq":922,"translations":923,"contributing":924,"docs":925,"en":926,"markdownlint":927,"disable":928,"md001":929,"md041":930,"align":931,"center":932,"picture":933,"prefers":934,"scheme":935,"dark":936,"srcset":937,"raw":938,"githubusercontent":939,"main":940,"assets":941,"logos":942,"logo":943,"text":944,"png":945,"img":946,"alt":947,"src":948,"light":949,"width":950,"55":951,"h3":952,"easy":953,"fast":954,"cheap":955,"llm":956,"serving":957,"href":958,"documentation":959,"blog":960,"arxiv":961,"abs":962,"2309":963,"06180":964,"paper":965,"vllm_project":966,"twitter":967,"discuss":968,"user":969,"forum":970,"developer":971,"news":972,"2025":973,"08":974,"hosted":975,"beijing":976,"meetup":977,"mp":978,"weixin":979,"qq":980,"dgkwg1wfpwgo2jcdtqqhxa":981,"large":982,"scale":983,"deployment":984,"slides":985,"drive":986,"google":987,"folders":988,"1pid6nsflu43dzri0eatcpgxsazdvbbqf":989,"recording":990,"chaspark":991,"live":992,"1166916873711665152":993,"05":994,"nyc":995,"lu":996,"ma":997,"c1rqyf1f":998,"presentation":999,"1_q_aw_iomjwuimf1s1ym":1000,"zhjxz8cuel0ijvaquoybea":1001,"usp":1002,"sharing":1003,"now":1004,"under":1005,"foundation":1006,"announcement":1007,"welcomes":1008,"01":1009,"excited":1010,"announce":1011,"alpha":1012,"release":1013,"v1":1014,"major":1015,"architectural":1016,"upgrade":1017,"7x":1018,"speedup":1019,"clean":1020,"optimized":1021,"execution":1022,"loop":1023,"zero":1024,"overhead":1025,"prefix":1026,"caching":1027,"enhanced":1028,"multimodal":1029,"support":1030,"more":1031,"post":1032,"27":1033,"summary":1034,"previous":1035,"04":1036,"asia":1037,"day":1038,"sginnovate":1039,"limited":1040,"availability":1041,"morning":1042,"evening":1043,"slots":1044,"inaugural":1045,"team":1046,"19cp6qu8u48ihb91a064xfaxrunyiboukrbxamdolloo":1047,"03":1048,"ollama":1049,"inference":1050,"night":1051,"16t2pdd1ywrnz4tu8q5r6n53c5lr5c73uv9vd2_ebo4u":1052,"china":1053,"n77gibl2coratqhtveazfg":1054,"1rehvfqmkgnvz6p3fd23hhso4c8j5wpgzv0bkylwnhyq":1055,"east":1056,"coast":1057,"7mu4k4xx":1058,"1nhiv8euff1nld3feyodm56ndml26leexcadgydltsrs":1059,"slide":1060,"id":1061,"g31441846c39_0_0":1062,"02":1063,"ninth":1064,"h7g3kuj9":1065,"meta":1066,"1jzc_pzvxrvnsfvcw":1067,"v4cfxb6pn7zz2cyp_flwo05aqg":1068,"1zk5qejiktmlq2eqcxqzlljax3m9s7nwn":1069,"view":1070,"posted":1071,"eighth":1072,"zep56hui":1073,"cloud":1074,"1epvkt4zu8jz_s5ohehpc798emsyh2bwyfruddvef7u4":1075,"1h24phewanyrl11xy5dxubvrc9f9kkjix":1076,"2024":1077,"joins":1078,"ecosystem":1079,"seventh":1080,"h0qvrajz":1081,"snowflake":1082,"goog":1083,"le":1084,"1e3cxqbv3jsfgp30swyvs3em_tw":1085,"ghohj9pajgk6kr54":1086,"1qf3rkdaboulwz9wk5toltt2fe9t6uic_hvnlfaaqx6a":1087,"created":1088,"coordinating":1089,"discussing":1090,"features":1091,"feel":1092,"join":1093,"ray":1094,"summit":1095,"held":1096,"special":1097,"track":1098,"opening":1099,"talk":1100,"1b_kqxphbtra_mdf":1101,"tr6i8rwdou5qotznceg2mkzxehm":1102,"learn":1103,"talks":1104,"youtube":1105,"playlist":1106,"plztswpqnepxl6aqwifuwuimlpfrvpksjr":1107,"users":1108,"09":1109,"sixth":1110,"87q3nvnh":1111,"1wrlgwytqfaotd5wcgspnhoaw3nq0e":1112,"9wqyp7ny93xrs":1113,"07":1114,"fifth":1115,"lp0gyjqr":1116,"aws":1117,"1rgud8acfchocghop3zmxzck9vx3rci9yfuab2bbcl4y":1118,"partnership":1119,"supports":1120,"llama":1121,"pipeline":1122,"23":1123,"llama31":1124,"06":1125,"fourth":1126,"agivllm":1127,"cloudflare":1128,"bentoml":1129,"1ij8o7v2bqei0bfeljltwc5g1s10_rhv3beed5ob0nj4":1130,"third":1131,"robloxandvllmmeetup2024":1132,"splashthat":1133,"roblox":1134,"47jak4bj39t954hytkvtfwn0fkqtsl8ngfuslrem":1135,"second":1136,"ygxbpzhl":1137,"ibm":1138,"12mi2skabnuw5rbwxdyy":1139,"hthth4imsnceoq10jdqbxga":1140,"2023":1141,"a16z":1142,"1ql":1143,"xpfxifpdbh86dbeegfxbxfxjix4v032ghshbkf3s":1144,"would":1145,"express":1146,"sincere":1147,"gratitude":1148,"andreessen":1149,"horowitz":1150,"30":1151,"supporting":1152,"generous":1153,"grant":1154,"development":1155,"research":1156,"released":1157,"fastchat":1158,"integration":1159,"powered":1160,"lmsys":1161,"vicuna":1162,"chatbot":1163,"arena":1164,"chat":1165,"mid":1166,"april":1167,"originally":1168,"developed":1169,"sky":1170,"computing":1171,"lab":1172,"cs":1173,"berkeley":1174,"edu":1175,"uc":1176,"evolved":1177,"driven":1178,"both":1179,"academia":1180,"industry":1181,"state":1182,"art":1183,"throughput":1184,"efficient":1185,"management":1186,"key":1187,"value":1188,"memory":1189,"pagedattention":1190,"20":1191,"continuous":1192,"batching":1193,"incoming":1194,"requests":1195,"model":1196,"graph":1197,"quantizations":1198,"2210":1199,"17323":1200,"2306":1201,"00978":1202,"autoround":1203,"05516":1204,"int4":1205,"int8":1206,"flashattention":1207,"flashinfer":1208,"speculative":1209,"decoding":1210,"chunked":1211,"prefill":1212,"flexible":1213,"seamless":1214,"popular":1215,"hugging":1216,"face":1217,"high":1218,"algorithms":1219,"parallel":1220,"sampling":1221,"beam":1222,"search":1223,"tensor":1224,"data":1225,"expert":1226,"distributed":1227,"streaming":1228,"outputs":1229,"openai":1230,"ap":1231,"server":1232,"gpus":1233,"cpus":1234,"intel":1235,"powerpc":1236,"tpu":1237,"neuron":1238,"multi":1239,"lora":1240,"seamlessly":1241,"huggingface":1242,"transformer":1243,"llms":1244,"mixture":1245,"mixtral":1246,"deepseek":1247,"v3":1248,"embedding":1249,"e5":1250,"mistral":1251,"modal":1252,"llava":1253,"full":1254,"supported_models":1255,"getting":1256,"started":1257,"pip":1258,"getting_started":1259,"index":1260,"wheel":1261,"bash":1262,"visit":1263,"quickstart":1264,"welcome":1265,"collaborations":1266,"how":1267,"sponsors":1268,"compute":1269,"resources":1270,"testing":1271,"following":1272,"organizations":1273,"thank":1274,"your":1275,"alphabetical":1276,"md":1277,"cash":1278,"donations":1279,"dropbox":1280,"sequoia":1281,"capital":1282,"skywork":1283,"zhenfund":1284,"alibaba":1285,"anyscale":1286,"crusoe":1287,"databricks":1288,"deepinfra":1289,"lambda":1290,"nebius":1291,"novita":1292,"replicate":1293,"runpod":1294,"trainy":1295,"san":1296,"diego":1297,"sponsor":1298,"fundraising":1299,"venue":1300,"opencollective":1301,"plan":1302,"fund":1303,"maintenance":1304,"adoption":1305,"citation":1306,"cite":1307,"bibtex":1308,"inproceedings":1309,"kwon2023efficient":1310,"title":1311,"author":1312,"woosuk":1313,"kwon":1314,"zhuohan":1315,"li":1316,"siyuan":1317,"zhuang":1318,"ying":1319,"sheng":1320,"lianmin":1321,"zheng":1322,"cody":1323,"hao":1324,"yu":1325,"joseph":1326,"gonzalez":1327,"zhang":1328,"ion":1329,"stoica":1330,"booktitle":1331,"proceedings":1332,"acm":1333,"sigops":1334,"29th":1335,"symposium":1336,"operating":1337,"systems":1338,"principles":1339,"year":1340,"contact":1341,"start":1342,"technical":1343,"feature":1344,"fellow":1345,"disclosures":1346,"advisories":1347,"partnerships":1348,"lists":1349,"mailto":1350,"end":1351,"kit":1352,"wish":1353,"refer":1354,"repo":1355,"releasing":1356,"releases":1357,"offer":1358,"reliable":1359,"packaged":1360,"binary":1361,"format":1362,"conveniently":1363,"accessed":1364,"pypi":1365,"serve":1366,"milestones":1367,"newly":1368,"improvements":1369,"upcoming":1370,"changes":1371,"affect":1372,"breaking":1373,"versioning":1374,"shifted":1375,"where":1376,"new":1377,"patch":1378,"every":1379,"weeks":1380,"contain":1381,"bug":1382,"opposed":1383,"semver":1384,"contains":1385,"backwards":1386,"critical":1387,"made":1388,"post1":1389,"_major_":1390,"milestone":1391,"incompatible":1392,"similar":1393,"_minor_":1394,"_patch_":1395,"_post1_":1396,"_patch":1397,"1_":1398,"either":1399,"implicit":1400,"cadence":1401,"bi":1402,"weekly":1403,"days":1404,"same":1405,"future":1406,"dates":1407,"below":1408,"tentative":1409,"optional":1410,"date":1411,"jan":1412,"feb":1413,"mar":1414,"apr":1415,"jun":1416,"jul":1417,"13":1418,"aug":1419,"14":1420,"15":1421,"sep":1422,"16":1423,"17":1424,"oct":1425,"18":1426,"19":1427,"nov":1428,"21":1429,"dec":1430,"22":1431,"dedicated":1432,"performed":1433,"prev":1434,"iously":1435,"reused":1436,"builds":1437,"triggered":1438,"push":1439,"rc":1440,"tag":1441,"vx":1442,"rc1":1443,"enables":1444,"test":1445,"multiple":1446,"rcs":1447,"trigger":1448,"notes":1449,"monitor":1450,"reverts":1451,"apply":1452,"cherry":1453,"pick":1454,"criteria":1455,"approach":1456,"finalizing":1457,"picks":1458,"land":1459,"pr":1460,"typically":1461,"sufficient":1462,"complete":1463,"thorough":1464,"round":1465,"stable":1466,"regression":1467,"functional":1468,"performance":1469,"recent":1470,"severe":1471,"silent":1472,"incorrectness":1473,"compatibility":1474,"crashes":1475,"deadlocks":1476,"leaks":1477,"introduced":1478,"change":1479,"identifiers":1480,"ci":1481,"prs":1482,"merged":1483,"trunk":1484,"exception":1485,"manual":1486,"validations":1487,"e2e":1488,"validation":1489,"perform":1490,"regressions":1491,"benchmark":1492,"workflow":1493,"workflows":1494,"yml":1495,"coverage":1496,"llama3":1497,"llama4":1498,"hardware":1499,"h100":1500,"mi300x":1501,"_note":1502,"based":1503,"availability_":1504,"access":1505,"request":1506,"write":1507,"ac":1508,"cess":1509,"repository":1510,"review":1511,"familiarize":1512,"yourself":1513,"configurations":1514,"tree":1515,"benchmarks":1516,"navigate":1517,"v0":1518,"once":1519,"completes":1520,"dashboard":1521,"hud":1522,"reponame":1523,"2fvllm":1524,"corresponding":1525,"comparison":1526,"compare":1527,"verify":1528,"occurred":1529,"vs":1530,"starttime":1531,"thu":1532,"2c":1533,"2017":1534,"20apr":1535,"202025":1536,"2021":1537,"3a43":1538,"3a50":1539,"20gmt":1540,"stoptime":1541,"wed":1542,"2016":1543,"20jul":1544,"granularity":1545,"week":1546,"lbranch":1547,"lcommit":1548,"b6553be1bc75f046b00046a4ad7576364d03c835":1549,"rbranch":1550,"rcommit":1551,"a5dd03c1ebc5e4f56f3c9d3dc0436e9c582c978f":1552,"benchmarkname":1553,"modelname":1554,"20models":1555,"backendname":1556,"20backends":1557,"modename":1558,"20modes":1559,"dtypename":1560,"20dtype":1561,"devicename":1562,"20devices":1563,"archname":1564,"20platforms":1565,"policy":1566,"reporting":1567,"report":1568,"privately":1569,"vulnerability":1570,"submission":1571,"form":1572,"triage":1573,"reports":1574,"triaged":1575,"vulnerability_management":1576,"threat":1577,"guide":1578,"usage":1579,"assumptions":1580,"recommendations":1581,"blob":1582,"securely":1583,"severity":1584,"determine":1585,"risk":1586,"taking":1587,"dealing":1588,"past":1589,"defaults":1590,"cases":1591,"categories":1592,"vulnerabilities":1593,"allow":1594,"remote":1595,"attackers":1596,"execute":1597,"arbitrary":1598,"system":1599,"significantly":1600,"compromise":1601,"confidentiality":1602,"integrity":1603,"privileges":1604,"needed":1605,"network":1606,"deserialization":1607,"exploit":1608,"chains":1609,"generally":1610,"rated":1611,"cvss":1612,"flaws":1613,"elevated":1614,"rce":1615,"contexts":1616,"significant":1617,"loss":1618,"advanced":1619,"conditions":1620,"trust":1621,"modes":1622,"node":1623,"privileged":1624,"scores":1625,"moderate":1626,"cause":1627,"denial":1628,"service":1629,"partial":1630,"disruption":1631,"breach":1632,"rating":1633,"low":1634,"minor":1635,"iss":1636,"ues":1637,"informational":1638,"logging":1639,"errors":1640,"exploitable":1641,"weaknesses":1642,"local":1643,"privilege":1644,"negligible":1645,"side":1646,"collisions":1647,"often":1648,"less":1649,"prenotification":1650,"prenotify":1651,"vendors":1652,"purpose":1653,"coordinated":1654,"notification":1655,"contacts":1656,"advisory":1657,"few":1658,"added":1659,"send":1660,"copying":1661,"vendor":1662,"analyzed":1663,"case":1664,"withdraw":1665,"receiving":1666,"prenotifications":1667,"membership":1668,"refinements":1669,"who":1670,"included":1671,"def":1672,"find_cuda_init":1673,"fn":1674,"callable":1675,"object":1676,"none":1677,"helper":1678,"function":1679,"debug":1680,"re":1681,"initialization":1682,"initializes":1683,"prints":1684,"stack":1685,"trace":1686,"happens":1687,"_lazy_init":1688,"nonlocal":1689,"traceback":1690,"extract_stack":1691,"print":1692,"initialized":1693,"format_list":1694,"strip":1695,"load_module_from_path":1696,"module_name":1697,"spec":1698,"importlib":1699,"util":1700,"spec_from_file_location":1701,"module":1702,"module_from_spec":1703,"sys":1704,"modules":1705,"loader":1706,"exec_module":1707,"is_sccache_available":1708,"int":1709,"os":1710,"getenv":1711,"vllm_disable_sccache":1712,"is_ccache_available":1713,"ccache":1714,"is_ninja_available":1715,"is_url_available":1716,"url":1717,"str":1718,"urllib":1719,"urlopen":1720,"except":1721,"200":1722,"class":1723,"cmakeextension":1724,"__init__":1725,"self":1726,"name":1727,"cmake_lists_dir":1728,"kwa":1729,"super":1730,"py_limited_api":1731,"abspath":1732,"cmake_build_ext":1733,"build_ext":1734,"dict":1735,"been":1736,"configured":1737,"did_config":1738,"number":1739,"jobs":1740,"optionally":1741,"compute_num_jobs":1742,"num_jobs":1743,"max_jobs":1744,"envs":1745,"logger":1746,"sched_getaffinity":1747,"universally":1748,"fall":1749,"back":1750,"cpu_count":1751,"len":1752,"attributeerror":1753,"_is_cuda":1754,"get_nvcc_cuda_version":1755,"reduce":1756,"overloading":1757,"max":1758,"ext":1759,"ve":1760,"cmakelists":1761,"exit":1762,"early":1763,"select":1764,"optimization":1765,"default_cfg":1766,"relwithdebinfo":1767,"cfg":1768,"cmake_args":1769,"dcmake_build_type":1770,"dcmake_verbose_makefile":1771,"dcmake_c_compiler_launcher":1772,"dcmake_cxx_compiler_launcher":1773,"dcmake_cuda_compiler_launcher":1774,"dcmake_hip_compiler_launcher":1775,"elif":1776,"pass":1777,"exact":1778,"reuse":1779,"subsequent":1780,"calls":1781,"dvllm_python_path":1782,"downloads":1783,"root":1784,"deps":1785,"allows":1786,"profiles":1787,"plays":1788,"fc_base_dir":1789,"root_dir":1790,"environ":1791,"dfetchcontent_base_dir":1792,"tool":1793,"num_job":1794,"dnvcc_threads":1795,"build_tool":1796,"dcmake_job_pool_compile":1797,"dcmake_job_pools":1798,"whatever":1799,"cuda_home":1800,"dcmake_cuda_compiler":1801,"bin":1802,"subprocess":1803,"check_call":1804,"cwd":1805,"build_temp":1806,"build_extensions":1807,"present":1808,"working":1809,"check_output":1810,"oserror":1811,"raise":1812,"runtimeerror":1813,"cannot":1814,"create":1815,"exist":1816,"makedirs":1817,"target_name":1818,"removeprefix":1819,"build_args":1820,"proper":1821,"outdir":1822,"get_ext_fullpath":1823,"parent":1824,"skip":1825,"directo":1826,"ry":1827,"continue":1828,"appends":1829,"range":1830,"count":1831,"actually":1832,"components":1833,"install_args":1834,"standard":1835,"copy":1836,"build_lib":1837,"editable":1838,"recursive":1839,"dst_file":1840,"split":1841,"dirname":1842,"exist_ok":1843,"copy_file":1844,"precompiled_build_ext":1845,"disables":1846,"precompiled":1847,"binaries":1848,"assert":1849,"vllm_use_precompiled":1850,"precompiled_wheel_utils":1851,"extracts":1852,"existing":1853,"staticmethod":1854,"extract_precompiled_and_patch_package":1855,"wheel_url_or_path":1856,"tempfile":1857,"zipfile":1858,"temp_dir":1859,"isfile":1860,"wheel_filename":1861,"mkdtemp":1862,"wheels":1863,"wheel_path":1864,"downloading":1865,"urlretrieve":1866,"filename":1867,"package_data_patch":1868,"files_to_copy":1869,"abi3":1870,"_flashmla_c":1871,"_vllm_fa2_c":1872,"_vllm_fa3_c":1873,"compiled_regex":1874,"file_members":1875,"filelist":1876,"target_path":1877,"target_pa":1878,"th":1879,"wb":1880,"dst":1881,"shutil":1882,"copyfileobj":1883,"pkg":1884,"replace":1885,"setdefault":1886,"basename":1887,"finally":1888,"removing":1889,"rmtree":1890,"get_base_commit_in_main_branch":1891,"nightly":1892,"mainly":1893,"vllm_test_use_precompiled_nightly_wheel":1894,"upstream":1895,"resp_json":1896,"curl":1897,"repos":1898,"decode":1899,"utf":1900,"upstream_main_commit":1901,"json":1902,"loads":1903,"sha":1904,"context":1905,"immutable":1906,"missing":1907,"vllm_docker_build_context":1908,"cat":1909,"calledprocesserror":1910,"fetch":1911,"branches":1912,"ensures":1913,"ref":1914,"current_branch":1915,"show":1916,"base_commit":1917,"merge":1918,"valueerror":1919,"err":1920,"dev":1921,"_no_device":1922,"empty":1923,"has_cuda":1924,"_is_neuron":1925,"_is_tpu":1926,"_is_hip":1927,"_is_cpu":1928,"_is_xpu":1929,"xpu":1930,"_build_custom_ops":1931,"get_rocm_version":1932,"rocm_home":1933,"librocm":1934,"core":1935,"d11f5c20d500f729c393680a01fa902ebf92094b":1936,"rocm_version":1937,"l21":1938,"librocm_core_file":1939,"lib":1940,"is_file":1941,"librocm_core":1942,"ctypes":1943,"cdll":1944,"vererrors":1945,"c_uint32":1946,"get_rocm_core_version":1947,"getrocmversion":1948,"restype":1949,"argtypes":1950,"pointer":1951,"byref":1952,"get_neuronxcc_version":1953,"sysconfig":1954,"site_dir":1955,"get_paths":1956,"purelib":1957,"version_file":1958,"neuronxcc":1959,"executed":1960,"fp":1961,"content":1962,"read":1963,"regular":1964,"__version__":1965,"apex":1966,"8b7a1ff183741dd8f9b87e7bafd04cfde99cea28":1967,"nvcc_output":1968,"universal_newlines":1969,"release_idx":1970,"nvcc_cuda_version":1971,"parse":1972,"get_gaudi_sw_version":1973,"returns":1974,"console":1975,"printing":1976,"hl":1977,"smi":1978,"shell":1979,"capture_output":1980,"enable_console":1981,"returncode":1982,"stdout":1983,"get_vllm_version":1984,"get_version":1985,"write_to":1986,"might":1987,"cuda_version":1988,"main_cuda_version":1989,"cuda_version_str":1990,"tarball":1991,"sdist":1992,"argv":1993,"neuron_version":1994,"neuron_version_str":1995,"unknown":1996,"runtime":1997,"get_requirements":1998,"requirements_dir":1999,"_read_requirements":2000,"resolved_requirements":2001,"startswith":2002,"cuda_major":2003,"cuda_minor":2004,"modified_requirements":2005,"req":2006,"unsupported":2007,"platform":2008,"print_top_10_largest_files":2009,"zip_file":2010,"top":2011,"largest":2012,"zip":2013,"file_sizes":2014,"getinfo":2015,"file_size":2016,"namelist":2017,"reverse":2018,"1024":2019,"2f":2020,"mbs":2021,"uncompressed":2022,"check_wheel_size":2023,"whl":2024,"walk":2025,"file_name":2026,"endswith":2027,"wheel_size_mb":2028,"getsize":2029,"vllm_max_size_mb":2030,"larger":2031,"mb":2032,"limit":2033,"fill":2034,"description":2035,"ensuring":2036,"checklist":2037,"items":2038,"bottom":2039,"essential":2040,"elements":2041,"effective":2042,"fix":2043,"resolve":2044,"pasting":2045,"necessary":2046,"updating":2047,"submitting":2048,"anything":2049,"removed":2050,"benchmarking":2051,"readme":2052,"guides":2053,"tests":2054,"extensive":2055,"datasets":2056,"living":2057,"document":2058,"updated":2059,"become":2060,"dataset":2061,"overview":2062,"table":2063,"style":2064,"100":2065,"border":2066,"collapse":2067,"thead":2068,"tr":2069,"left":2070,"65":2071,"tbody":2072,"td":2073,"strong":2074,"sharegpt":2075,"wget":2076,"co":2077,"anon8231489123":2078,"sharegpt_vicuna_unfiltered":2079,"sharegpt_v3_unfiltered_cleaned_split":2080,"sharegpt4v":2081,"image":2082,"lin":2083,"chen":2084,"sharegpt4v_instruct_gpt4":2085,"vision_cap100k":2086,"br":2087,"div":2088,"images":2089,"downloaded":2090,"separately":2091,"coco":2092,"train":2093,"http":2094,"cocodataset":2095,"zips":2096,"train2017":2097,"burstgpt":2098,"hpmll":2099,"burstgpt_without_fails_2":2100,"csv":2101,"sonnet":2102,"deprecated":2103,"random":2104,"synthetic":2105,"repetition":2106,"visionarena":2107,"lmarena":2108,"instructcoder":2109,"likaixin":2110,"aimo":2111,"mo":2112,"aime":2113,"numinamath":2114,"cot":2115,"lmms":2116,"onevision":2117,"aeala":2118,"custom":2119,"jsonl":2120,"hf":2121,"nousresearch":2122,"hermes":2123,"8b":2124,"benc":2125,"endpoint":2126,"completions":2127,"num":2128,"prompts":2129,"successful":2130,"duration":2131,"78":2132,"total":2133,"tokens":2134,"1369":2135,"2212":2136,"73":2137,"token":2138,"tok":2139,"382":2140,"89":2141,"619":2142,"85":2143,"mean":2144,"ttft":2145,"ms":2146,"71":2147,"54":2148,"median":2149,"88":2150,"p99":2151,"79":2152,"49":2153,"excl":2154,"1st":2155,"tpot":2156,"91":2157,"96":2158,"inter":2159,"latency":2160,"itl":2161,"74":2162,"70":2163,"39":2164,"even":2165,"customdataset":2166,"needs":2167,"prompt":2168,"field":2169,"entry":2170,"india":2171,"iran":2172,"vllm_use_v1":2173,"instruct":2174,"bench":2175,"port":2176,"9001":2177,"save":2178,"detailed":2179,"80":2180,"concurrency":2181,"temperature":2182,"75":2183,"dir":2184,"applying":2185,"vision":2186,"capability":2187,"qwen":2188,"qwen2":2189,"vl":2190,"7b":2191,"1000":2192,"config":2193,"method":2194,"ngram":2195,"num_speculative_tokens":2196,"prompt_lookup_max":2197,"prompt_lookup_min":2198,"2048":2199,"huggingfacedataset":2200,"subset":2201,"chart2text":2202,"cauldron":2203,"qwq":2204,"32b":2205,"seed":2206,"42":2207,"philschmid":2208,"mt":2209,"parameters":2210,"backends":2211,"client":2212,"ramp":2213,"rate":2214,"ramping":2215,"over":2216,"useful":2217,"stress":2218,"finding":2219,"maximum":2220,"handle":2221,"budget":2222,"two":2223,"strategies":2224,"linear":2225,"increases":2226,"linearly":2227,"exponential":2228,"exponentially":2229,"arguments":2230,"strategy":2231,"rps":2232,"beginning":2233,"4656":2234,"00":2235,"1072":2236,"5014":2237,"1500":2238,"backen":2239,"counts":2240,"4036":2241,"92":2242,"326":2243,"90":2244,"14527":2245,"1280":2246,"vllm_worker_multiproc_method":2247,"spawn":2248,"async":2249,"engine":2250,"104":2251,"77":2252,"23836":2253,"10477":2254,"261136":2255,"204800":2256,"adapters":2257,"dataset_path":2258,"dataset_name":2259,"loras":2260,"rank":2261,"yard1":2262,"sql":2263,"structured":2264,"grammar":2265,"regex":2266,"schema":2267,"benchmark_serving_structured_output":2268,"ratio":2269,"structure":2270,"choice":2271,"xgrammar":2272,"xgrammar_bench":2273,"long":2274,"qa":2275,"question":2276,"answering":2277,"basic":2278,"benchmark_long_document_qa_throughput":2279,"documents":2280,"length":2281,"2000":2282,"50":2283,"repeat":2284,"different":2285,"mode":2286,"shuffle":2287,"randomly":2288,"3000":2289,"tile":2290,"entire":2291,"sequence":2292,"interleave":2293,"consecutively":2294,"efficiency":2295,"automatic":2296,"fixed":2297,"benchmark_prefix_caching":2298,"128":2299,"256":2300,"rang":2301,"prefix_repetition":2302,"512":2303,"suffix":2304,"prefixes":2305,"prioritization":2306,"benchmark_prioritization":2307,"64":2308,"scheduling":2309,"priority":2310,"sequences":2311,"entrypoints":2312,"api_server":2313,"dtype":2314,"bfloat16":2315,"mm":2316,"benchmark_serving":2317,"vllm_benchmark_results":2318,"completion":2319,"requestfuncinput":2320,"api_url":2321,"prompt_len":2322,"output_len":2323,"model_name":2324,"logprobs":2325,"extra_body":2326,"multi_modal_content":2327,"ignore_eos":2328,"requestfuncoutput":2329,"generated_text":2330,"success":2331,"float":2332,"output_tokens":2333,"default_factory":2334,"latencies":2335,"avg":2336,"next":2337,"async_request_tgi":2338,"request_func_input":2339,"pbar":2340,"tqdm":2341,"generate_stream":2342,"aiohttp":2343,"clientsession":2344,"trust_env":2345,"timeout":2346,"aiohttp_timeout":2347,"session":2348,"params":2349,"max_new_tokens":2350,"do_sample":2351,"tgi":2352,"accept":2353,"top_p":2354,"99":2355,"truncate":2356,"ignore_eos_token":2357,"payload":2358,"inputs":2359,"st":2360,"perf_counter":2361,"most_recent_timestamp":2362,"chunk_bytes":2363,"sometimes":2364,"ping":2365,"chunk":2366,"timestamp":2367,"phase":2368,"reason":2369,"exc_info":2370,"format_exception":2371,"async_request_trt_llm":2372,"accumulate_tokens":2373,"text_input":2374,"max_tokens":2375,"stream":2376,"min_length":2377,"text_output":2378,"async_request_deepspeed_mii":2379,"profile":2380,"deepspeed":2381,"mii":2382,"temp":2383,"headers":2384,"authorization":2385,"bearer":2386,"openai_api_key":2387,"28":2388,"placeholder":2389,"microsoft":2390,"pull":2391,"311":2392,"parsed_resp":2393,"await":2394,"choices":2395,"unexpected":2396,"neither":2397,"nor":2398,"els":2399,"async_request_openai_completions":2400,"repetition_penalty":2401,"stream_options":2402,"include_usage":2403,"first_chunk_received":2404,"done":2405,"completion_tokens":2406,"never":2407,"received":2408,"valid":2409,"calculate":2410,"fal":2411,"se":2412,"async_request_openai_chat_completions":2413,"mm_content":2414,"isinstance":2415,"extend":2416,"typeerror":2417,"role":2418,"max_completion_tokens":2419,"application":2420,"most_recent_tim":2421,"estamp":2422,"sse":2423,"pings":2424,"colon":2425,"skipped":2426,"delta":2427,"async_request_openai_audio":2428,"lazy":2429,"placeholdermodule":2430,"dep":2431,"soundfile":2432,"transcriptions":2433,"flattened":2434,"due":2435,"multipart":2436,"stream_include_usage":2437,"stream_continuous_usage_stats":2438,"audio":2439,"to_bytes":2440,"sr":2441,"buffer":2442,"io":2443,"bytesio":2444,"wav":2445,"seek":2446,"mm_audio":2447,"containing":2448,"formdata":2449,"add_field":2450,"content_type":2451,"get_model":2452,"pretrained_model_name_or_path":2453,"vllm_use_modelscope":2454,"lower":2455,"modelscope":2456,"snapshot_download":2457,"model_executor":2458,"model_loader":2459,"weight_utils":2460,"get_lock":2461,"lock":2462,"processes":2463,"weights":2464,"model_path":2465,"model_id":2466,"local_files_only":2467,"huggingface_hub":2468,"constants":2469,"hf_hub_offline":2470,"ignore_file_pattern":2471,"pt":2472,"safetensors":2473,"get_tokenizer":2474,"tokenizer_mode":2475,"auto":2476,"trust_remote_code":2477,"kwargs":2478,"union":2479,"pretrainedtokenizer":2480,"pretrainedtokenizerfast":2481,"slow":2482,"use_fast":2483,"tokenizer":2484,"transformers_utils":2485,"mistraltokenizer":2486,"importerror":2487,"from_pretrained":2488,"autotokenizer":2489,"args":2490,"rows":2491,"allocate_block":2492,"allocate_blocks":2493,"enforce":2494,"gc":2495,"collect":2496,"ahead":2497,"minimize":2498,"among":2499,"runs":2500,"block_pool":2501,"blockpool":2502,"num_gpu_blocks":2503,"enable_caching":2504,"get_blocks_times":2505,"timecollector":2506,"free_blocks_times":2507,"num_iteration":2508,"blocks":2509,"get_new_blocks":2510,"free_blocks":2511,"cnt":2512,"dump_avg_max":2513,"tabulate":2514,"iterations":2515,"nblocks":2516,"allocated":2517,"navg":2518,"nmax":2519,"tablefmt":2520,"grid":2521,"floatfmt":2522,"3f":2523,"invoke_main":2524,"parser":2525,"flexibleargumentparser":2526,"kv":2527,"add_argument":2528,"100000":2529,"iteration":2530,"help":2531,"stablize":2532,"readings":2533,"allocate":2534,"nargs":2535,"500":2536,"parse_args":2537,"samplerequest":2538,"represents":2539,"expected_output_len":2540,"multi_modal_data":2541,"multimodaldatadict":2542,"lora_request":2543,"lorarequest":2544,"benchmarkdataset":2545,"abc":2546,"default_seed":2547,"is_multimodal":2548,"random_seed":2549,"initialize":2550,"indicates":2551,"reproducible":2552,"shuffling":2553,"replaced":2554,"apply_multimodal_chat_transformation":2555,"transform":2556,"expect":2557,"conversation":2558,"load_data":2559,"load":2560,"subclasses":2561,"vary":2562,"depending":2563,"raises":2564,"notimplementederror":2565,"subclass":2566,"implement":2567,"todo":2568,"jenniferzhao":2569,"implemented":2570,"get_random_lora_request":2571,"pretrainedtokenizerbase":2572,"max_loras":2573,"option":2574,"al":2575,"lora_path":2576,"tuple":2577,"anytokenizer":2578,"associated":2579,"selects":2580,"retrieves":2581,"cached":2582,"disk":2583,"element":2584,"applicable":2585,"lora_id":2586,"randint":2587,"lora_name":2588,"lora_int_id":2589,"lora_path_on_disk":2590,"lora_tokenizer_cache":2591,"get_lora_tokenizer":2592,"abstractmethod":2593,"sample":2594,"num_requests":2595,"abstract":2596,"subcl":2597,"asses":2598,"logic":2599,"generating":2600,"objects":2601,"processing":2602,"maybe_oversample_requests":2603,"oversamples":2604,"sampled":2605,"oversampled":2606,"reach":2607,"samples":2608,"is_valid_sequence":2609,"min_len":2610,"max_prompt_len":2611,"max_total_len":2612,"skip_min_output_len_check":2613,"validate":2614,"lengths":2615,"pruning":2616,"copied":2617,"original":2618,"sample_hf_requests":2619,"sample_sharegpt_requests":2620,"sample_requests":2621,"benchmark_throughput":2622,"invalid":2623,"prompt_too_short":2624,"output_too_short":2625,"prompt_too_long":2626,"combined_too_long":2627,"met":2628,"get_adapter_absolute_path":2629,"process_image":2630,"mapping":2631,"multimedia":2632,"dictionary":2633,"three":2634,"bytes":2635,"expects":2636,"pil":2637,"converts":2638,"rgb":2639,"saves":2640,"jpeg":2641,"encodes":2642,"base64":2643,"treats":2644,"prepends":2645,"convert_image_mode":2646,"image_data":2647,"image_base64":2648,"b64encode":2649,"getvalue":2650,"image_url":2651,"randomdataset":2652,"values":2653,"default_prefix_len":2654,"default_range_ratio":2655,"default_input_len":2656,"default_output_len":2657,"prefix_len":2658,"range_ratio":2659,"input_len":2660,"random_range_ratio":2661,"vocab_size":2662,"num_special_tokens":2663,"num_special_tokens_to_add":2664,"real_input_len":2665,"prefix_token_ids":2666,"np":2667,"tolist":2668,"input_low":2669,"input_high":2670,"output_low":2671,"bound":2672,"failures":2673,"output_high":2674,"debugging":2675,"input_lens":2676,"output_lens":2677,"offsets":2678,"inner_seq":2679,"arange":2680,"token_sequence":2681,"encode":2682,"again":2683,"consecutive":2684,"give":2685,"tokenized":2686,"gpt2tokenizer":2687,"6880":2688,"6881":2689,"ġcalls":2690,"1650":2691,"939":2692,"486":2693,"ġcall":2694,"sh":2695,"ere":2696,"uncontrolled":2697,"encoded":2698,"truncated":2699,"total_input_len":2700,"re_encoded_sequence":2701,"add_special_tokens":2702,"sharegptdataset":2703,"implements":2704,"turns":2705,"loading":2706,"encoding":2707,"entries":2708,"conversations":2709,"enable_multimodal_chat":2710,"break":2711,"prompt_ids":2712,"input_ids":2713,"completion_ids":2714,"new_output_len":2715,"sharegpt4video":2716,"image_path":2717,"dictionaries":2718,"standardized":2719,"convert":2720,"filetype":2721,"assume":2722,"jsonl_data":2723,"pd":2724,"read_json":2725,"path_or_buf":2726,"lines":2727,"column":2728,"columns":2729,"row":2730,"dataframe":2731,"corresponds":2732,"iterrows":2733,"to_dict":2734,"skip_chat_template":2735,"sampled_requests":2736,"item":2737,"apply_chat_template":2738,"add_generation_prompt":2739,"tokenize":2740,"sonnetdataset":2741,"simplified":2742,"implementation":2743,"poem":2744,"550":2745,"150":2746,"readlines":2747,"return_prompt_formatted":2748,"average":2749,"tokenized_lines":2750,"avg_len":2751,"sum":2752,"base_prompt":2753,"many":2754,"base_msg":2755,"base_fmt":2756,"base_offset":2757,"higher":2758,"num_input_lines":2759,"num_prefix_lines":2760,"prefix_lines":2761,"while":2762,"extra_lines":2763,"msg":2764,"prompt_formatted":2765,"burstgptdataset":2766,"gpt":2767,"df":2768,"read_csv":2769,"gpt4_df":2770,"_sample_loaded_data":2771,"random_state":2772,"lora_req":2773,"ist":2774,"ids":2775,"computed":2776,"modulo":2777,"token_ids":2778,"supported_dataset_paths":2779,"dataset_split":2780,"no_stream":2781,"dataset_subset":2782,"load_stream":2783,"load_dataset":2784,"conversationdataset":2785,"filtered_data":2786,"dynamic_output":2787,"conv":2788,"completion_len":2789,"longer":2790,"accurate":2791,"actual":2792,"visionarenadataset":2793,"parser_fn":2794,"instructcoderdataset":2795,"designed":2796,"general":2797,"editing":2798,"consists":2799,"114":2800,"239":2801,"instruction":2802,"triplets":2803,"covers":2804,"distinct":2805,"scenario":2806,"mtbenchdataset":2807,"turn":2808,"9d98ab5ec":2809,"offline_inference":2810,"eagle":2811,"l14":2812,"l18":2813,"noqa":2814,"e501":2815,"sd":2816,"aimodataset":2817,"reasoning":2818,"problem":2819,"solution":2820,"32000":2821,"_format_zeta_prompt":2822,"original_start_marker":2823,"editable_region_start":2824,"zeta":2825,"prediction":2826,"nep":2827,"formats":2828,"further":2829,"extended":2830,"events":2831,"marker":2832,"indicating":2833,"region":2834,"formatted":2835,"zeta_prompt":2836,"focused":2837,"output_start_index":2838,"output_focused_region":2839,"expected_output":2840,"nexteditpredictiondataset":2841,"zed":2842,"industries":2843,"mapping_prompt_funcs":2844,"formatting_prompt_func":2845,"asrdataset":2846,"asr":2847,"transcription":2848,"tested":2849,"domain":2850,"speaking":2851,"ted":2852,"lium":2853,"oratory":2854,"release1":2855,"release2":2856,"release3":2857,"speaker":2858,"adaptation":2859,"voxpopuli":2860,"european":2861,"parliament":2862,"de":2863,"fr":2864,"librispeech":2865,"audiobook":2866,"narrated":2867,"tedlium":2868,"gigaspeech":2869,"podcast":2870,"spontaneous":2871,"xs":2872,"xl":2873,"spgispeech":2874,"financial":2875,"meetings":2876,"ami":2877,"ihm":2878,"sdm":2879,"openslr":2880,"librispeech_asr":2881,"facebook":2882,"edinburghcstr":2883,"speechcolab":2884,"kensho":2885,"whisper":2886,"interface":2887,"transcription_preamble":2888,"startoftranscript":2889,"transcribe":2890,"notimestamps":2891,"skip_long_audios":2892,"librosa":2893,"array":2894,"sampling_rate":2895,"duration_s":2896,"get_duration":2897,"discarded":2898,"greater":2899,"save_to_pytorch_benchmark_format":2900,"argparse":2901,"namespace":2902,"pt_records":2903,"convert_to_pytorch_benchmark_format":2904,"metrics":2905,"extra_info":2906,"avg_latency":2907,"percentiles":2908,"pt_file":2909,"splitext":2910,"output_json":2911,"write_to_json":2912,"engine_args":2913,"engineargs":2914,"from_cli_args":2915,"processed":2916,"batch":2917,"batches":2918,"dataclasses":2919,"asdict":2920,"llm_engine":2921,"model_config":2922,"max_model_len":2923,"sampling_params":2924,"samplingparams":2925,"detokenize":2926,"disable_detokenize":2927,"dummy_prompt_token_ids":2928,"10000":2929,"batch_size":2930,"dummy_prompts":2931,"prompttype":2932,"prompt_token_ids":2933,"llm_generate":2934,"use_beam_search":2935,"use_tqdm":2936,"beam_search":2937,"beamsearchparams":2938,"beam_width":2939,"run_to_completion":2940,"profile_dir":2941,"start_profile":2942,"stop_profile":2943,"start_time":2944,"end_time":2945,"warming":2946,"num_iters_warmup":2947,"desc":2948,"warmup":2949,"vllm_torc":2950,"h_profiler_dir":2951,"profiling":2952,"saved":2953,"num_iters":2954,"percentages":2955,"25":2956,"percentile":2957,"seconds":2958,"percentage":2959,"dump":2960,"indent":2961,"create_argument_parser":2962,"till":2963,"32":2964,"store_true":2965,"iters":2966,"responses":2967,"detokenization":2968,"measurement":2969,"add_cli_args":2970,"skews":2971,"numbers":2972,"set_defaults":2973,"enable_prefix_caching":2974,"test_long_document_qa":2975,"spent":2976,"parameter":2977,"strings":2978,"4f":2979,"secs":2980,"repeat_prompts":2981,"repeat_count":2982,"times":2983,"depends":2984,"repeated":2985,"moving":2986,"repeated_prompts":2987,"shuffle_seed":2988,"prepare":2989,"hi":2990,"document_length":2991,"num_documents":2992,"repeat_mode":2993,"warmup_prompts":2994,"warm":2995,"roughly":2996,"excluding":2997,"20000":2998,"min":2999,"max_ngram":3000,"collector":3001,"modelconfig":3002,"opt":3003,"125m":3004,"task":3005,"num_token":3006,"num_spec_token":3007,"proposer":3008,"ngramproposer":3009,"vllm_config":3010,"vllmconfig":3011,"speculative_config":3012,"speculativeconfig":3013,"min_ngram":3014,"propose":3015,"num_req":3016,"gram":3017,"drafting":3018,"minimum":3019,"test_prefix":3020,"cost":3021,"sample_tokens":3022,"vocab":3023,